[
    {
        "id": "seminar1",
        "title": "Exploring Living Matter through Large Collectives.",
        "date": "2025-04-09",
        "time": "13:15 - 13:55",
        "speaker": "Luke Costello",
        "topic": "Exploring Living Matter through Large Collectives.",
        "image": "images/luke.jpg",
        "abstract": "Developments in physical sciences over the last couple hundred years have enabled us to understand the nature and general tendencies of the matter that comprises much of the observable universe. Missing from this picture, however, is a general understanding of where living things fit in. Life tends to be comprised of active components, who themselves are little open systems interacting in complex ways with each other and their environments and who are consequently not easily described by equilibrium theories like classical Thermodynamics. I'll talk about my work observing large collectives (of locusts and fish) as a kind of 'living matter' as a way to try to improve our understanding of living systems in general.",
        "bio": "Luke Costello is a PostDoc in the Department of Collective Behavior at the Max Planck Institute of Animal Behavior (MPIAB). He received a BS in Chemistry from Oregon State University, an MS in Materials Science and Engineering from the University of Delaware, and a PhD in Mechanical Engineering from the Georgia Institute of Technology. His current research interests are in applying concepts from chemistry and physics to understanding the biology of large collectives and also vice versa - using observations of large biological systems to understand basic principles of nature.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar2",
        "title": "Counterfactual rewards promote collective transport using individually controlled swarm microrobots",
        "date": "2025-04-16",
        "time": "11:30 - 12:15",
        "speaker": "Veit-Lorenz Heuthe",
        "topic": "Counterfactual rewards promote collective transport using individually controlled swarm microrobots",
        "image": "images/Veit-Lorenz_Heuthe.JPG",
        "abstract": "Swarm robots offer fascinating opportunities to perform complex tasks beyond the capabilities of individual machines. Just as a swarm of ants collectively moves large objects, similar functions can emerge within a group of robots through individual strategies based on local sensing. However, realizing collective functions with individually controlled microrobots is particularly challenging because of their micrometer size, large number of degrees of freedom, strong thermal noise relative to the propulsion speed, and complex physical coupling between neighboring microrobots. Here, we implemented multiagent reinforcement learning (MARL) to generate a control strategy for up to 200 microrobots whose motions are individually controlled by laser spots. During the learning process, we used so-called counterfactual rewards that automatically assign credit to the individual microrobots, which allows fast and unbiased training. With the help of this efficient reward scheme, swarm microrobots learn to collectively transport a large cargo object to an arbitrary position and orientation, similar to ant swarms. We show that this flexible and versatile swarm robotic system is robust to variations in group size, the presence of malfunctioning units, and environmental noise. In addition, we let the robot swarms manipulate multiple objects simultaneously in a demonstration experiment, highlighting the benefits of distributed control and independent microrobot motion. Control strategies such as ours can potentially enable complex and automated assembly of mobile micromachines, programmable drug delivery capsules, and other advanced lab-on-a-chip applications.",
        "bio": "To be added...",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar3",
        "title": "What I Did Last Winter",
        "date": "2025-04-23",
        "time": "11:30 - 12:15",
        "speaker": "Heiko Hamann",
        "topic": "What I Did Last Winter",
        "image": "images/Hamann.jpg",
        "abstract": "During my sabbatical in the past winter term, I undertook a research-focused journey spanning four international collaborations, each advancing different facets of intelligent autonomous systems. In Boston, USA, I worked with Prof. Carlo Pinciroli at Worcester Polytechnic Institute (WPI) on the development of scalable software infrastructure for swarm robotics, aimed at improving the programmability of large-scale robot collectives. In Granada, Spain, I collaborated with Dr. Héctor García de Marina on the control of multi-drone systems, with a particular focus on the coordination of fixed-wing UAVs operating in decentralized settings. In Bogotá, Colombia, I joined Prof. Félix Mohr at Universidad de La Sabana to explore the use of automated machine learning (AutoML) in the analysis of electrophysiological data from natural plants, investigating plant sensing and signal propagation with ML tools. Finally, in Cape Town, South Africa, I collaborated with Prof. Geoff Nitschke at the University of Cape Town on evolutionary swarm robotics, examining how evolutionary algorithms can be used to design collective robot behaviors (e.g., shepherding). Together, these research stays broadened the scope of my work across swarm robotics, aerial systems, AI for biosignal interpretation, and evolutionary design, while reinforcing the global and interdisciplinary nature of modern swarm robotics research.",
        "bio": "Since 2022 Heiko Hamann is professor for Cyber-physical Systems at the University of Konstanz, Germany, and member of the \"Centre for the Advanced Study of Collective Behaviour\" in Konstanz. Before he was professor at the University of Luebeck and the University of Paderborn. His main research interests are swarm robotics, bio-hybrid systems, evolutionary robotics, and modeling of complex systems. He enjoys working in multi-disciplinary teams with ethologists, plant biologists, architects, and psychologists. Heiko Hamann is author of the book \"Swarm Robotics: A Formal Approach\" (Springer, 2018) and currently working on the 2nd edition which is expected by so many in the world. He is editor-in-chief of the Swarm Intelligence Journal since 2023.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar4",
        "title": "Multi-scale analysis of phase transition and swarm initiation in desert locusts.",
        "date": "2025-04-30",
        "time": "11:30 - 12:15",
        "speaker": "Daniele Carlesso",
        "topic": "Multi-scale analysis of phase transition and swarm initiation in desert locusts.",
        "image": "images/daniele.jpeg",
        "abstract": "The desert locust, a form of grasshopper, is a notorious plague insect. Swarms of locusts can extend over several hundred square kilometers with up to 80 million individuals per km2, posing severe threats to global food security. However, locusts do not always swarm. When food is abundant and population density is low, individuals remain as cryptic and sedentary ‘solitarious’ grasshoppers. Population upsurges and swarming arises when food scarcity in highly populated areas forces locusts to aggregate around limited resources, causing a transition to the ‘gregarious’ swarm-forming phase. Although behavioral and physiological changes associated with crowding have been widely documented, the biological mechanisms mediating the initiation of swarming and collective migrations are not well understood. We combine laboratory swarming assays with virtual reality and RNA sequencing to investigate when and how collective locust marching emerges. We use motion capture technology to continuously monitor the behaviour of solitary locusts during their first exposure to marching bands of gregarious conspecifics across several days. Preliminary findings suggest that, while rapid changes in response to conspecifics can be observed within a few hours, these do not appear sufficient to drive persistent phenotypic changes. Instead, solitary locusts displayed instances of marching-like behaviour after one day of crowding and started continuously marching only after multiple days of exposure to conspecifics. Complementary experiments in virtual reality - where individual locusts are embedded within immersive, responsive, and photorealistic virtual swarms with predefined statistics – demonstrate that exposure to moving virtual conspecifics is sufficient to trigger marching behaviour in solitary locusts crowded for three days. Further analyses will provide deeper insights into how changes in individual interaction maps and kinematics can lead to the formation of coordinated marching events.",
        "bio": "To be added...",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar5",
        "title": "Mesh2SLAM in VR: A Fast Geometry-Based SLAM Framework for Rapid Prototyping in Virtual Reality Applications.",
        "date": "2025-05-07",
        "time": "11:30 - 12:15",
        "speaker": "Carlos Pinheiro",
        "topic": "Mesh2SLAM in VR: A Fast Geometry-Based SLAM Framework for Rapid Prototyping in Virtual Reality Applications.",
        "image": "images/carlos.jpeg",
        "abstract": "Simultaneous Localization and Mapping (SLAM) is a cornerstone of robotics and AR/VR applications. While SLAM simulations are essential for testing new approaches, resource-constrained devices such as VR head-mounted displays (HMDs) pose challenges due to high computational demands and limited access to sensor data. This work introduces a sparse SLAM framework that leverages mesh geometry projections as features, improving efficiency and bypassing the need for direct sensor input. We demonstrate its effectiveness in simulation for VR applications and through numerical evaluations, advancing SLAM research for constrained environments.",
        "bio": "Carlos Pinheiro is a PhD candidate at the University of Konstanz, researching real-time SLAM and 3D reconstruction for XR, robotics, and multi-agent systems. His background in CGI, video game development, and computer vision bridges graphics and vision with classical and modern AI—expertise he now applies to enabling efficient spatial computing on resource-constrained devices. Before re-entering academia, he worked at Softkinetic (now Sony DepthSensing Solutions), NXP Semiconductors, MBJ Solutions, Hensoldt Sensors, and Lake Fusion Technologies—where he developed systems for embedded validation, industrial AI, military VR, multi-object tracking on different domains including LiDAR, camera, and radar, and mixed-reality ADAS simulation.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar6",
        "title": "Decisions on the Move: Embodied Spatiotemporal Computations.",
        "date": "2025-05-14",
        "time": "11:30 - 12:15",
        "speaker": "August Paula",
        "topic": "Decisions on the Move: Embodied Spatiotemporal Computations.",
        "image": "images/august.jpeg",
        "abstract": "Animals rely on movement to efficiently locate essential resources—such as food, mates, or nesting sites—for survival and reproduction. Over millions of generations, natural selection has refined neural algorithms guiding these movements to ensure reliability and efficiency. My research focuses on identifying and analysing such functional movement algorithms, particularly the mechanisms underlying decision-making and spontaneous search behaviours. Specifically, I study how ring attractor neural networks can integrate spatial information, support adaptive decision-making, and generate exploratory patterns. To test and refine this theoretical framework, I conduct experiments where real ants interact with virtual environments, effectively playing video games designed to probe their spatial decision-making processes.",
        "bio": "August Paula is a researcher at the Department of Collective Behavior, Max Planck Institute of Animal Behavior and the University of Konstanz. His research explores emergent patterns in animal movement by developing virtual reality systems for insects and computer vision algorithms for wildlife videography.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar7",
        "title": "Energetic benefits of social information use for movement decisions in soaring flight.",
        "date": "2025-05-21",
        "time": "11:30 - 12:15",
        "speaker": "Eleonora Gatti",
        "topic": "Energetic benefits of social information use for movement decisions in soaring flight.",
        "image": "images/eleonora.jpeg",
        "abstract": "Animal movement is essential for survival, allowing individuals to find food, mates, and avoid predators. Soaring birds depend on updrafts of air to reduce energy costs, but these resources are patchy and unpredictable. We use an Agent-Based Model to examine how social information influences movement efficiency in collective soaring flight by reducing uncertainty about resource availability. Our model simulates agents navigating a dynamic energy landscape through glide-soar movement. We assess how social reliance and risk-taking behavior interact with environmental predictability to shape movement performance in terms of energetic costs. In the talk, I will present our model, show some results, and share a few cool condor pictures from our field trip in Argentina.",
        "bio": "Eleonora Gatti is a PhD student at the University of Konstanz in the Move.in.Formation group, studying optimal movement in soaring flight. After studying Physics at the University of Milan, she completed her master's thesis in the Department of Collective Behavior, where she worked on models of collective decision making.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar8",
        "title": "Swarm ro-bat-ics: a robotic platform to understand the behaviour of echolocating bats.",
        "date": "2025-05-28",
        "time": "14:30 - 15:15",
        "speaker": "Gabriele Baroli",
        "topic": "Swarm ro-bat-ics: a robotic platform to understand the behaviour of echolocating bats",
        "image": "images/gabrielle.jpg",
        "abstract": "In an effort to better understand how large groups of bats can achieve collective motion relying only on echolocation in extremely complex acoustic scenarios, the Ro-Bat platform was ideated and realized. After the successful implementation of a robot capable of passive echolocation, the necessary following step was to give the very same robot the facilities to echolocate by actively emitting loud ultrasonic calls and processing their echoes, just as bats and other animal species do continuously to move in their surroundings. For this reason several pieces of equipment were developed, such as a suitable audio source and a microphone array intended intended to work at ultrasonic frequencies, together with a signal processing chain apt to emulate the behaviour of an echolocating bat on the move. The system built was then characterized regarding its acoustic performances, and its obstacle avoidance behaviour was tested. Having reached a satisfying prototype, this platform will be replicated in the near future to put to test multiple robots echolocating together, to test a multitude of variables which can influence the achievement of a successful acoustically mediated collective movement.",
        "bio": "Gabriele Baroli earned his B.Sc. in Engineering of Computing Systems from the Polytechnic University of Milan in 2022. He is currently completing his M.Sc. in Music and Acoustic Engineering at the same university, working on his thesis at the University of Konstanz. His research is hosted by the Centre for the Advanced Study of Collective Behaviour and co-supervised by Andreagiovanni Reina (GIO-Lab) and Thejasvi Beleyur (Active Sensing Collectives).",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar9",
        "title": "Making insects play video games.",
        "date": "2025-06-04",
        "time": "11:30 - 12:15",
        "speaker": "Pavan Kaushik",
        "topic": "Making insects play video games.",
        "image": "images/pavan.jpg",
        "abstract": "To be added.",
        "bio": "To be added.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar10",
        "title": "Emergent orchestra: a framework for bio-inspired musical robot swarms.",
        "date": "2025-06-11",
        "time": "11:30 - 12:15",
        "speaker": "Pierluigi Tartabini",
        "topic": "Emergent orchestra: a framework for bio-inspired musical robot swarms.",
        "image": "images/pierluigi.jpg",
        "abstract": "Can music emerge from a swarm of robots, each playing a single note and coordinating with the others? This project drives an exploration of music as a complex system, where rhythm, harmony, and structure arise from local interactions rather than centralized control. Drawing inspiration from musical ensembles and group synchronization, a bio-inspired framework is presented to reproduce a self-organized swarm of robots that  behaves like a conductorless orchestra. Through minimal communication and distributed rules, the system reveals how musical patterns and collective creativity can emerge from simple, coordinated behaviors.",
        "bio": "Pierluigi Tartabini is a Master’s student at Politecnico di Milano, currently conducting his thesis research at the Centre for the Advanced Study of Collective Behaviour in Konstanz, under the supervision of Andreagiovanni Reina and Lluc Bono Rosselló.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar11",
        "title": "Securing Collaborative SLAM with Blockchain: A Trustworthy Approach to Multi-Robot Mapping.",
        "date": "2025-06-18",
        "time": "11:30 - 12:15",
        "speaker": "Iacopo Fornai",
        "topic": "Securing Collaborative SLAM with Blockchain: A Trustworthy Approach to Multi-Robot Mapping",
        "image": "images/iacopo.jpg",
        "abstract": "SLAM (Simultaneous Localization and Mapping) is a fundamental topic in robotics, enabling one or more robots to create a map of their environment and localize themselves within it. My research focuses on securing Swarm-SLAM, a state-of-the-art collaborative SLAM system, against malicious or faulty robots that may inject false information, potentially leading to corrupted maps or inaccurate pose estimations. This is achieved by leveraging blockchain technology—a decentralized and tamper-resistant digital ledger that guarantees data integrity and trustworthiness.",
        "bio": "Iacopo Fornai is a student of Automation and Control Engineering at Politecnico di Milano, currently pursuing his master’s thesis at the University of Konstanz under the supervision of Andreagiovanni Reina and Alexandre Pacheco.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar12",
        "title": "Early Thoughts on Robot Control and Interaction.",
        "date": "2025-06-25",
        "time": "11:30 - 12:15",
        "speaker": "Bosco Román",
        "topic": "Early Thoughts on Robot Control and Interaction.",
        "image": "images/bosco.jpg",
        "abstract": "Robot swarms offer innovative solutions to modern challenges like large-area rescue and fire control. To scale without overwhelming communication channels, they must operate in a decentralized manner, relying on local interactions to achieve global goals. This raises a key question: what are the global effects of local errors, such as distance mismatches or data dropouts? Indeed, minor issues can escalate, leading to unintended and potentially harmful emergent behaviours. In this seminar, we’ll explore how to understand and potentially harness these, in principle unintended, emergent behaviours to improve swarm performance.",
        "bio": "Bosco Román earned his B.Sc. in Physics from the Complutense University of Madrid in 2024. He is currently working as a research assistant in the Swarm Systems Lab (ERC grant) at the University of Granada. His research is hosted by the Institute of Mathematics of Granada and supervised by Héctor García de Marina.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar13",
        "title": "Understanding Human Actions by Skipping Through Old YouTube.",
        "date": "2025-07-02",
        "time": "11:30 - 12:15",
        "speaker": "Ulas Sureyya Bingöl",
        "topic": "Understanding Human Actions by Skipping Through Old YouTube.",
        "image": "images/ulas.jpg",
        "abstract": "Understanding Human Actions by Skipping Through Old YouTube Based on CONCUR: Contrastive Observation Network with Cross-Video Understanding and Retrieval. We work on recognizing and localizing human actions in long, untrimmed videos—like the kind you’d randomly find on old YouTube. This is tricky when only the overall action label is known, without any info on when it happens. Our method, CONCUR, improves learning from such weak labels by comparing snippets both within the same video and across different ones. By aligning similar segments between videos and filtering out irrelevant parts, we help the model better understand where actions really occur. Tested on the THUMOS14 dataset, CONCUR outperforms existing methods by making smarter use of both temporal structure and video relationships.",
        "bio": "Ulas Bingöl earned a Master’s degree in Electrical and Electronics Engineering from Middle East Technical University, Turkey, in 2022. During his master's studies, he worked in robotics perception - localization while working as a software lead in an international logistics robotics company. After completing his degree, he continued working in the industry before transitioning to academia. He is currently pursuing a PhD in Computer Science at the University of Konstanz, where his research focuses on computer vision and deep learning.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar14",
        "title": "Automated Phytosensing: Ozone Exposure Classification Based on Plant Electrical Signals.",
        "date": "2025-03-12",
        "time": "13:15 - 13:35",
        "speaker": "Till Aust",
        "topic": "Automated Phytosensing: Ozone Exposure Classification Based on Plant Electrical Signals",
        "image": "images/Aust.png",
        "abstract": "In the WatchPlant project, we explore the potential of using a decentralized network of living plants as air-quality sensors by analyzing their electrophysiological responses—a concept known as phytosensing. We conducted in-lab experiments in which we expose ivy (Hedera helix) plants to ozone, an important pollutant to monitor, and measured their electrophysiological response. Because there is no well established automated way of detecting ozone exposure in plants, we propose a generic automatic toolchain that selects a high-performance subset of features and highly accurate models for plant electrophysiology. This approach derives plantand stimulus-generic features from the electrophysiological signal using the tsfresh library. Based on these features, we automatically select and optimize machine learning models using naive AutoML. We use forward feature selection to increase model performance. We show that our approach successfully classifies plant ozone exposure with accuracies of up to 94.6% on unseen data. We also show that our approach can be used for other plant species and stimuli. Our toolchain automates the development of monitoring algorithms for plants as pollutant monitors.",
        "bio": "Till Aust studied Robotics and Autonomous Systems at the University of Lübeck, where he earned both his Bachelor's and Master's degrees. He then joined the Cyber-Physical Systems Group led by Prof. Heiko Hamann as a PhD student, focusing on the analysis of physiological signals in bio-hybrid systems. His research contributes to the EU-funded projects WatchPlant and ChronoPilot, where he explores methods to interpret physiological data for controlling bio-hybrid systems and enabling feedback mechanisms.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar15",
        "title": "Automating Damage Recovery in a Legged Robot.",
        "date": "2025-03-12",
        "time": "13:35 - 13:55",
        "speaker": "Sindiso Mkhatshwa",
        "topic": "Automating Damage Recovery in a Legged Robot",
        "image": "images/Mkhatshwa.png",
        "abstract": "Autonomous robots are increasingly used in remote and hazardous environments, where automated recovery given damage to sensory-actuator systems would be extremely beneficial. Such robots must therefore have controllers that continue to function effectively given unexpected hardware malfunctions and damage. We evaluate various controller types (oscillator style central pattern generators and artificial neural networks), for producing adaptable gait behaviors. These controller types are run for hexapod robot gait control in concert with the Intelligent Trial and Error (IT&E) and Map-Elites algorithm to maintain behavioral diversity. Specifically, we investigate the impact of behavior map-size in MAP-Elites (the first phase of the IT&E algorithm), in company with various controller types for multiple leg failures scenarios using a simulated hexapod robot. Results support previous work demonstrating a trade-off between adapted gait speed and controller adaptability across leg-damage scenarios, where map-size is crucial for generating behavioral diversity required for adaptation.",
        "bio": "Sindiso Mkhatshwa earned a Master's degree in Computer Science from the University of Cape Town, South Africa, in 2023. He is currently pursuing a Ph.D. in Informatik at the Centre for the Advanced Study of Collective Behavior at the University of Konstanz, Germany. His research broadly focuses on collective decision-making in robot swarms.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar16",
        "title": "Bioinspired robotics: from biology to robotics and back.",
        "date": "2025-03-05",
        "time": "13:15 - 13:55",
        "speaker": "Liang Li",
        "topic": "Bioinspired robotics: from biology to robotics and back.",
        "image": "images/liang.jpg",
        "abstract": "With over half a billion years of evolutionary history, fish swim with high efficiency, great agility, and surprising stealth in the three-dimensional aquatic environment. Therefore, it is undoubtedly natural for engineers to turn to fish as a source of new ideas on underwater propulsive systems. Over the past decades, roboticists, inspired by these biological systems, have constructed various fish-like robots that copy real fish morphology, locomotion, and movement. Recently, the direction of bio-inspiration has started to flip to bio-understanding—using robotics in engineering to help answer questions in biology. In this talk, I will first introduce how we construct and control the robotic fish following the paradigm of bio-inspiration. Then, I will give examples of applying real and virtual robots to help us explore why and how do fish school. Finally, I will briefly introduce my ongoing and future work in bio-inspiration and bio-understanding.",
        "bio": "Liang Li is a Group Leader (PI) at the Max-Planck Institute of Animal Behavior and the University of Konstanz. He received a bachelor's degree in automation from Chongqing University in 2011 and a PhD in general mechanics and foundation of mechanics from Peking University in 2017. From February 2017 to June 2024, he was a Postdoctoral Research Fellow and Project Leader in the Department of Collective Behaviour, Max Planck Institute of Animal Behavior, Konstanz, Germany. His research interests include bio-inspired robots, swarm robots, collective behaviour in hybrid animal-robot systems, and bio-fluid dynamics in fish schools. He has published interdisciplinary studies in more than 46 peer-reviewed journals, including Nature Communications and PNAS. He also serves as a reviewer for these journals. He is an IEEE senior Member, received the Messmer Foundation Award, the Best Poster Award at the Conference on Robots for Science organized by Science Robotics, and secured multiple grants to pursue research into developing and applying robots for studying biological phenomena.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar17",
        "title": "Who works harder today? Allocating agents efficiently among several tasks of heterogeneous difficulty.",
        "date": "2025-02-19",
        "time": "13:15 - 13:55",
        "speaker": "Simay Atasoy",
        "topic": "Who works harder today? Allocating agents efficiently among several tasks of heterogeneous difficulty.",
        "image": "images/simay.png",
        "abstract": "In collective systems, efficient task allocation is crucial to maximize group performance, especially when agents face many tasks with heterogeneous difficulties. In such scenarios, an allocation strategy needs to balance both various task difficulties and available agents as a limited resource. Difficult tasks may require more agents to achieve similar accuracies across tasks, but a limited amount of agents requires careful allocation for high overall performance. We propose an algorithm for allocating agents to tasks with various difficulties to achieve maximum accuracy.",
        "bio": "Simay Atasoy earned a Master’s degree in Electrical and Electronics Engineering from Middle East Technical University, Turkey, in 2022.During her master's studies, she worked in the robotics research and development department of a company. After completing her degree, she continued working in the industry before transitioning to academia. She is currently pursuing a PhD in Computer Science at the University of Konstanz, where her research focuses on collective decision making and task allocation.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar18",
        "title": "More dominant baboons have less and lower quality sleep.",
        "date": "2025-02-12",
        "time": "13:15 - 13:55",
        "speaker": "Marco Fele",
        "topic": "More dominant baboons have less and lower quality sleep.",
        "image": "images/marco.png",
        "abstract": "The amount and quality of sleep individuals get can impact various aspects of human and non-human animal health, ultimately affecting fitness. For wild animals that sleep in groups, individuals may disturb one another, influencing sleep quality and quantity, but this aspect of social sleep has been understudied due to methodological challenges. Here, we test the hypothesis that an individual's social dominance can affect sleep opportunities, by studying sleep patterns in a troop of wild chacma baboons (Papio ursinus), a species with a strong hierarchical social structure. First, we show that the troop’s night-time sleep (determined by 40Hz acceleration data) is highly synchronised. Next, we link night-time sleep dynamics to daytime spatial networks and dominance hierarchy (from 1Hz GPS data and direct observations). We show that baboon sleep synchrony is higher between similarly ranked individuals, and unexpectedly, more dominant baboons experience less and lower-quality sleep. We propose that this hierarchy effect is explained by higher-ranked baboons resting closer to more group members, which also leads them exerting greater influence on each other’s night-time behaviour compared to lower-ranked individuals. Our study provides the first empirical evidence for the impact of social hierarchies on sleep in a wild primate, suggesting that dominance status may impose trade-offs between social rank and the quality and quantity of sleep.",
        "bio": "Marco Fele is a third-year PhD student in Animal Collective Behaviour at Swansea University, Wales. His research interests include understanding how individual differences, such as social dominance rank, influence collective movement and activity synchronization. During his research visit at CASCB, he will develop a model of collective decision-making within the framework of signal detection theory, exploring scenarios where individuals have varying quorum thresholds.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar19",
        "title": "Emergent Collective Behavior in Multi-Agent Systems Through Predictive Coding.",
        "date": "2025-02-05",
        "time": "13:15 - 13:55",
        "speaker": "Nicolas Bessone",
        "topic": "Emergent Collective Behavior in Multi-Agent Systems Through Predictive Coding.",
        "image": "images/bessone.png",
        "abstract": "Predictive coding has emerged as a compelling framework for understanding perception and action in biological and artificial agents. In this work, we explore the implications of predictive coding in a multi-agent system, where each agent moves in a continuous environment and continuously predicts its future state based on sensory inputs. Agents minimize their prediction error by adapting their movement, leading to emergent collective behaviors such as aggregation, cohesion, and obstacle avoidance. Through simulations, we investigate how these behaviors arise from local predictive mechanisms without the need for explicit coordination or predefined interaction rules. Our results show that predictive coding not only enables individual agents to navigate their environment efficiently but also fosters self-organized collective structures that resemble swarm-like behavior observed in natural systems. The findings suggest that predictive coding can serve as a powerful principle for designing distributed intelligent systems capable of adaptive and emergent coordination.",
        "bio": "Nicolas Bessone is a PhD student at the IT University of Denmark, focusing on decentralized controllers for distributed systems and a multitude of side projects that range from agent-based modeling and music theory representations in computational spaces to neuroscience, physics, and artificial intelligence.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar21",
        "title": "Complex Systems and Music: Network representations and the emergent orchestra.",
        "date": "2025-01-22",
        "time": "14:10 - 14:50",
        "speaker": "Lluc Bono Rosselló",
        "topic": "Complex Systems and Music: Network representations and the emergent orchestra.",
        "image": "images/Lluc_Bono.png",
        "abstract": "In music, a random sequence of notes fails to capture our attention, while a monotonous four-note repetition quickly loses its appeal. So, what is it about certain musical structures that strikes the perfect balance between predictability and surprise? In this talk, I will introduce two complementary approaches from the field of complex systems to explore how these structures and interactions emerge. From a top-down perspective, I will show how network representations can be used to map and analyse patterns within musical pieces. From a bottom-up perspective, I will show how simple local interactions can lead to the emergence of richer, coordinated musical forms in a swarm of robots, as illustrated in our work with the Emergent Orchestra framework.",
        "bio": "Lluc Bono Rosselló is a PhD student at IRIDIA, Université Libre de Bruxelles (Belgium). His research focuses on studying creativity from a complex systems perspective, primarily using tools from network science and swarm intelligence. He holds a degree in Industrial Engineering from Valencia (Spain) and a Master’s in Computer Science and Engineering from ULB. Alongside his research, he has also contributed to more applied AI projects, such as a pilot initiative for the Brussels Region to automatically detect illegal animal sales and the development of an intelligent chatbot for the university using Large Language Models.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar22",
        "title": "Safe Robot Swarms: Methods to Prevent, Detect, and Mitigate Faults.",
        "date": "2025-01-08",
        "time": "13:15 - 13:55",
        "speaker": "Suet Ying Lee",
        "topic": "Safe Robot Swarms: Methods to Prevent, Detect, and Mitigate Faults.",
        "image": "images/suet.png",
        "abstract": "Robot swarms are susceptible to failure - both at the level of an individual robot and the swarm as a collective. Developing methods for fault detection, diagnosis and recovery (FDDR) will therefore be critical for successful deployment in real-world applications. My work focuses largely on data-driven methods for FDDR in swarms, methods which allow individuals to self-detect faults or to mitigate their impact on overall swarm performance. Additionally, in collaborative work, we design data-centric processes for the assurance of safe swarm behaviour, bridging the gap between experimental results and real-world safety requirements.",
        "bio": "Suet Lee earned an integrated Master’s degree in Mathematics from Imperial College London, UK. Since then she has worked in industry in the fields of software development and robotics, before returning to academia to complete a PhD in Swarm Robotics at the University of Bristol, Hauert Lab. Suet is currently a postdoctoral researcher at the University of Konstanz in the Cyber-Physical Systems group.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar23",
        "title": "Can we study how bats echolocate in swarms?",
        "date": "2024-12-05",
        "time": "13:30 - 14:10",
        "speaker": "Alberto Doimo",
        "topic": "Can we study how bats echolocate in swarms?",
        "image": "images/albertodoimo.jpg",
        "abstract": "Inspired by bats, the \"Ro-Bat\" platform uses only microphones to perceive complex, multi-source acoustic environments, providing biologists with a tool to study active localization agents like bats or robots within a swarm. This presentation will discuss the development of a passive echolocation system for autonomous swarm robots.",
        "bio": "Alberto Doimo is a Master's student in Acoustic Engineering at Politecnico di Milano, specialised in audio signal processing and echolocation. He is also a contributor to The Sound of Bees project at CASCB, to develop a way to record the Stop signal inside beehives.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar24",
        "title": "The role of interaction networks in decision-making processes for decentralized agent-based systems.",
        "date": "2024-12-04",
        "time": "12:00 - 12:40",
        "speaker": "Fabio Oddi",
        "topic": "The role of interaction networks in decision-making processes for decentralized agent-based systems.",
        "image": "images/fabiooddi.jpg",
        "abstract": "Quorum sensing is a fundamental mechanism that enables coordinated behavior within populations of autonomous agents and is widely studied in biological systems, from bacterial colonies to social insects. In swarm robotics, quorum sensing has attracted significant interest, primarily for implementing collective decision-making processes. This work explores the potential of leveraging quorum sensing to enable robotic swarms to adapt to dynamic environments in the context of the Best-of-N decision-making problem. The study aims to identify the most effective approach for this application, taking into consideration two widely adopted agent models in this context.",
        "bio": "Fabio Oddi earned a Master's degree in Control Engineering from Sapienza University of Rome, Italy, in 2022. He is currently pursuing a Ph.D. in Computer Science Engineering at the same institution, with his research funded by the Institute of Cognitive Sciences and Technologies of the National Research Council (ISTC-CNR). His research focuses on exploring the role of interaction networks in decision-making processes for decentralized agent-based systems.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar25",
        "title": "The Geometry of Decision Making in Robotic Swarms.",
        "date": "2024-12-11",
        "time": "13:30 - 14:10",
        "speaker": "Sindiso Mkhatshwa",
        "topic": "The Geometry of Decision Making in Robotic Swarms.",
        "image": "images/Mkhatshwa.png",
        "abstract": "Recent research suggests that when choosing among spatially distributed options, the brain repeatedly breaks multichoice decisions into a series of binary decisions in space–time. While previous studies have utilized fruit flies, desert locusts, and larval zebrafish to explore these fundamental geometric principles, we employ swarm robotics as a testbed to investigate how and why animals exhibit specific movement patterns.",
        "bio": "Sindiso Mkhatshwa earned a Master's degree in Computer Science from the University of Cape Town, South Africa, in 2023. He is currently pursuing a Ph.D. in Informatik at the Centre for the Advanced Study of Collective Behaviour at the University of Konstanz, Germany. His research broadly focuses on collective decision-making in robot swarms.",
        "location": "Z8 Kitchen"
    }
    
]
