[
    {
        "id": "seminar1",
        "title": "Exploring Living Matter through Large Collectives.",
        "date": "2025-04-09",
        "time": "13:15 - 13:55",
        "speaker": "Luke Costello",
        "topic": "Exploring Living Matter through Large Collectives.",
        "image": "images/luke.jpg",
        "abstract": "Developments in physical sciences over the last couple hundred years have enabled us to understand the nature and general tendencies of the matter that comprises much of the observable universe. Missing from this picture, however, is a general understanding of where living things fit in. Life tends to be comprised of active components, who themselves are little open systems interacting in complex ways with each other and their environments and who are consequently not easily described by equilibrium theories like classical Thermodynamics. I'll talk about my work observing large collectives (of locusts and fish) as a kind of 'living matter' as a way to try to improve our understanding of living systems in general.",
        "bio": "Luke Costello is a PostDoc in the Department of Collective Behavior at the Max Planck Institute of Animal Behavior (MPIAB). He received a BS in Chemistry from Oregon State University, an MS in Materials Science and Engineering from the University of Delaware, and a PhD in Mechanical Engineering from the Georgia Institute of Technology. His current research interests are in applying concepts from chemistry and physics to understanding the biology of large collectives and also vice versa - using observations of large biological systems to understand basic principles of nature.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar2",
        "title": "Counterfactual rewards promote collective transport using individually controlled swarm microrobots",
        "date": "2025-04-16",
        "time": "11:30 - 12:15",
        "speaker": "Veit-Lorenz Heuthe",
        "topic": "Counterfactual rewards promote collective transport using individually controlled swarm microrobots",
        "image": "images/Veit-Lorenz_Heuthe.JPG",
        "abstract": "Swarm robots offer fascinating opportunities to perform complex tasks beyond the capabilities of individual machines. Just as a swarm of ants collectively moves large objects, similar functions can emerge within a group of robots through individual strategies based on local sensing. However, realizing collective functions with individually controlled microrobots is particularly challenging because of their micrometer size, large number of degrees of freedom, strong thermal noise relative to the propulsion speed, and complex physical coupling between neighboring microrobots. Here, we implemented multiagent reinforcement learning (MARL) to generate a control strategy for up to 200 microrobots whose motions are individually controlled by laser spots. During the learning process, we used so-called counterfactual rewards that automatically assign credit to the individual microrobots, which allows fast and unbiased training. With the help of this efficient reward scheme, swarm microrobots learn to collectively transport a large cargo object to an arbitrary position and orientation, similar to ant swarms. We show that this flexible and versatile swarm robotic system is robust to variations in group size, the presence of malfunctioning units, and environmental noise. In addition, we let the robot swarms manipulate multiple objects simultaneously in a demonstration experiment, highlighting the benefits of distributed control and independent microrobot motion. Control strategies such as ours can potentially enable complex and automated assembly of mobile micromachines, programmable drug delivery capsules, and other advanced lab-on-a-chip applications.",
        "bio": "To be added...",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar3",
        "title": "What I Did Last Winter",
        "date": "2025-04-23",
        "time": "11:30 - 12:15",
        "speaker": "Heiko Hamann",
        "topic": "What I Did Last Winter",
        "image": "images/Hamann.jpg",
        "abstract": "During my sabbatical in the past winter term, I undertook a research-focused journey spanning four international collaborations, each advancing different facets of intelligent autonomous systems. In Boston, USA, I worked with Prof. Carlo Pinciroli at Worcester Polytechnic Institute (WPI) on the development of scalable software infrastructure for swarm robotics, aimed at improving the programmability of large-scale robot collectives. In Granada, Spain, I collaborated with Dr. Héctor García de Marina on the control of multi-drone systems, with a particular focus on the coordination of fixed-wing UAVs operating in decentralized settings. In Bogotá, Colombia, I joined Prof. Félix Mohr at Universidad de La Sabana to explore the use of automated machine learning (AutoML) in the analysis of electrophysiological data from natural plants, investigating plant sensing and signal propagation with ML tools. Finally, in Cape Town, South Africa, I collaborated with Prof. Geoff Nitschke at the University of Cape Town on evolutionary swarm robotics, examining how evolutionary algorithms can be used to design collective robot behaviors (e.g., shepherding). Together, these research stays broadened the scope of my work across swarm robotics, aerial systems, AI for biosignal interpretation, and evolutionary design, while reinforcing the global and interdisciplinary nature of modern swarm robotics research.",
        "bio": "Since 2022 Heiko Hamann is professor for Cyber-physical Systems at the University of Konstanz, Germany, and member of the \"Centre for the Advanced Study of Collective Behaviour\" in Konstanz. Before he was professor at the University of Luebeck and the University of Paderborn. His main research interests are swarm robotics, bio-hybrid systems, evolutionary robotics, and modeling of complex systems. He enjoys working in multi-disciplinary teams with ethologists, plant biologists, architects, and psychologists. Heiko Hamann is author of the book \"Swarm Robotics: A Formal Approach\" (Springer, 2018) and currently working on the 2nd edition which is expected by so many in the world. He is editor-in-chief of the Swarm Intelligence Journal since 2023.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar4",
        "title": "Multi-scale analysis of phase transition and swarm initiation in desert locusts.",
        "date": "2025-04-30",
        "time": "11:30 - 12:15",
        "speaker": "Daniele Carlesso",
        "topic": "Multi-scale analysis of phase transition and swarm initiation in desert locusts.",
        "image": "images/daniele.jpeg",
        "abstract": "The desert locust, a form of grasshopper, is a notorious plague insect. Swarms of locusts can extend over several hundred square kilometers with up to 80 million individuals per km2, posing severe threats to global food security. However, locusts do not always swarm. When food is abundant and population density is low, individuals remain as cryptic and sedentary ‘solitarious’ grasshoppers. Population upsurges and swarming arises when food scarcity in highly populated areas forces locusts to aggregate around limited resources, causing a transition to the ‘gregarious’ swarm-forming phase. Although behavioral and physiological changes associated with crowding have been widely documented, the biological mechanisms mediating the initiation of swarming and collective migrations are not well understood. We combine laboratory swarming assays with virtual reality and RNA sequencing to investigate when and how collective locust marching emerges. We use motion capture technology to continuously monitor the behaviour of solitary locusts during their first exposure to marching bands of gregarious conspecifics across several days. Preliminary findings suggest that, while rapid changes in response to conspecifics can be observed within a few hours, these do not appear sufficient to drive persistent phenotypic changes. Instead, solitary locusts displayed instances of marching-like behaviour after one day of crowding and started continuously marching only after multiple days of exposure to conspecifics. Complementary experiments in virtual reality - where individual locusts are embedded within immersive, responsive, and photorealistic virtual swarms with predefined statistics – demonstrate that exposure to moving virtual conspecifics is sufficient to trigger marching behaviour in solitary locusts crowded for three days. Further analyses will provide deeper insights into how changes in individual interaction maps and kinematics can lead to the formation of coordinated marching events.",
        "bio": "To be added...",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar5",
        "title": "Mesh2SLAM in VR: A Fast Geometry-Based SLAM Framework for Rapid Prototyping in Virtual Reality Applications.",
        "date": "2025-05-07",
        "time": "11:30 - 12:15",
        "speaker": "Carlos Pinheiro",
        "topic": "Mesh2SLAM in VR: A Fast Geometry-Based SLAM Framework for Rapid Prototyping in Virtual Reality Applications.",
        "image": "images/carlos.jpeg",
        "abstract": "Simultaneous Localization and Mapping (SLAM) is a cornerstone of robotics and AR/VR applications. While SLAM simulations are essential for testing new approaches, resource-constrained devices such as VR head-mounted displays (HMDs) pose challenges due to high computational demands and limited access to sensor data. This work introduces a sparse SLAM framework that leverages mesh geometry projections as features, improving efficiency and bypassing the need for direct sensor input. We demonstrate its effectiveness in simulation for VR applications and through numerical evaluations, advancing SLAM research for constrained environments.",
        "bio": "Carlos Pinheiro is a PhD candidate at the University of Konstanz, researching real-time SLAM and 3D reconstruction for XR, robotics, and multi-agent systems. His background in CGI, video game development, and computer vision bridges graphics and vision with classical and modern AI—expertise he now applies to enabling efficient spatial computing on resource-constrained devices. Before re-entering academia, he worked at Softkinetic (now Sony DepthSensing Solutions), NXP Semiconductors, MBJ Solutions, Hensoldt Sensors, and Lake Fusion Technologies—where he developed systems for embedded validation, industrial AI, military VR, multi-object tracking on different domains including LiDAR, camera, and radar, and mixed-reality ADAS simulation.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar6",
        "title": "Decisions on the Move: Embodied Spatiotemporal Computations.",
        "date": "2025-05-14",
        "time": "11:30 - 12:15",
        "speaker": "August Paula",
        "topic": "Decisions on the Move: Embodied Spatiotemporal Computations.",
        "image": "images/august.jpeg",
        "abstract": "Animals rely on movement to efficiently locate essential resources—such as food, mates, or nesting sites—for survival and reproduction. Over millions of generations, natural selection has refined neural algorithms guiding these movements to ensure reliability and efficiency. My research focuses on identifying and analysing such functional movement algorithms, particularly the mechanisms underlying decision-making and spontaneous search behaviours. Specifically, I study how ring attractor neural networks can integrate spatial information, support adaptive decision-making, and generate exploratory patterns. To test and refine this theoretical framework, I conduct experiments where real ants interact with virtual environments, effectively playing video games designed to probe their spatial decision-making processes.",
        "bio": "August Paula is a researcher at the Department of Collective Behavior, Max Planck Institute of Animal Behavior and the University of Konstanz. His research explores emergent patterns in animal movement by developing virtual reality systems for insects and computer vision algorithms for wildlife videography.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar7",
        "title": "Energetic benefits of social information use for movement decisions in soaring flight.",
        "date": "2025-05-21",
        "time": "11:30 - 12:15",
        "speaker": "Eleonora Gatti",
        "topic": "Energetic benefits of social information use for movement decisions in soaring flight.",
        "image": "images/eleonora.jpeg",
        "abstract": "Animal movement is essential for survival, allowing individuals to find food, mates, and avoid predators. Soaring birds depend on updrafts of air to reduce energy costs, but these resources are patchy and unpredictable. We use an Agent-Based Model to examine how social information influences movement efficiency in collective soaring flight by reducing uncertainty about resource availability. Our model simulates agents navigating a dynamic energy landscape through glide-soar movement. We assess how social reliance and risk-taking behavior interact with environmental predictability to shape movement performance in terms of energetic costs. In the talk, I will present our model, show some results, and share a few cool condor pictures from our field trip in Argentina.",
        "bio": "Eleonora Gatti is a PhD student at the University of Konstanz in the Move.in.Formation group, studying optimal movement in soaring flight. After studying Physics at the University of Milan, she completed her master's thesis in the Department of Collective Behavior, where she worked on models of collective decision making.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar8",
        "title": "Swarm ro-bat-ics: a robotic platform to understand the behaviour of echolocating bats.",
        "date": "2025-05-28",
        "time": "14:30 - 15:15",
        "speaker": "Gabriele Baroli",
        "topic": "Swarm ro-bat-ics: a robotic platform to understand the behaviour of echolocating bats",
        "image": "images/gabrielle.jpg",
        "abstract": "In an effort to better understand how large groups of bats can achieve collective motion relying only on echolocation in extremely complex acoustic scenarios, the Ro-Bat platform was ideated and realized. After the successful implementation of a robot capable of passive echolocation, the necessary following step was to give the very same robot the facilities to echolocate by actively emitting loud ultrasonic calls and processing their echoes, just as bats and other animal species do continuously to move in their surroundings. For this reason several pieces of equipment were developed, such as a suitable audio source and a microphone array intended intended to work at ultrasonic frequencies, together with a signal processing chain apt to emulate the behaviour of an echolocating bat on the move. The system built was then characterized regarding its acoustic performances, and its obstacle avoidance behaviour was tested. Having reached a satisfying prototype, this platform will be replicated in the near future to put to test multiple robots echolocating together, to test a multitude of variables which can influence the achievement of a successful acoustically mediated collective movement.",
        "bio": "Gabriele Baroli earned his B.Sc. in Engineering of Computing Systems from the Polytechnic University of Milan in 2022. He is currently completing his M.Sc. in Music and Acoustic Engineering at the same university, working on his thesis at the University of Konstanz. His research is hosted by the Centre for the Advanced Study of Collective Behaviour and co-supervised by Andreagiovanni Reina (GIO-Lab) and Thejasvi Beleyur (Active Sensing Collectives).",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar9",
        "title": "Making insects play video games.",
        "date": "2025-06-04",
        "time": "11:30 - 12:15",
        "speaker": "Pavan Kaushik",
        "topic": "Making insects play video games.",
        "image": "images/pavan.jpg",
        "abstract": "To be added.",
        "bio": "To be added.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar10",
        "title": "Emergent orchestra: a framework for bio-inspired musical robot swarms.",
        "date": "2025-06-11",
        "time": "11:30 - 12:15",
        "speaker": "Pierluigi Tartabini",
        "topic": "Emergent orchestra: a framework for bio-inspired musical robot swarms.",
        "image": "images/pierluigi.jpg",
        "abstract": "Can music emerge from a swarm of robots, each playing a single note and coordinating with the others? This project drives an exploration of music as a complex system, where rhythm, harmony, and structure arise from local interactions rather than centralized control. Drawing inspiration from musical ensembles and group synchronization, a bio-inspired framework is presented to reproduce a self-organized swarm of robots that  behaves like a conductorless orchestra. Through minimal communication and distributed rules, the system reveals how musical patterns and collective creativity can emerge from simple, coordinated behaviors.",
        "bio": "Pierluigi Tartabini is a Master’s student at Politecnico di Milano, currently conducting his thesis research at the Centre for the Advanced Study of Collective Behaviour in Konstanz, under the supervision of Andreagiovanni Reina and Lluc Bono Rosselló.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar11",
        "title": "Securing Collaborative SLAM with Blockchain: A Trustworthy Approach to Multi-Robot Mapping.",
        "date": "2025-06-18",
        "time": "11:30 - 12:15",
        "speaker": "Iacopo Fornai",
        "topic": "Securing Collaborative SLAM with Blockchain: A Trustworthy Approach to Multi-Robot Mapping",
        "image": "images/iacopo.jpg",
        "abstract": "SLAM (Simultaneous Localization and Mapping) is a fundamental topic in robotics, enabling one or more robots to create a map of their environment and localize themselves within it. My research focuses on securing Swarm-SLAM, a state-of-the-art collaborative SLAM system, against malicious or faulty robots that may inject false information, potentially leading to corrupted maps or inaccurate pose estimations. This is achieved by leveraging blockchain technology—a decentralized and tamper-resistant digital ledger that guarantees data integrity and trustworthiness.",
        "bio": "Iacopo Fornai is a student of Automation and Control Engineering at Politecnico di Milano, currently pursuing his master’s thesis at the University of Konstanz under the supervision of Andreagiovanni Reina and Alexandre Pacheco.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar12",
        "title": "Early Thoughts on Robot Control and Interaction.",
        "date": "2025-06-25",
        "time": "11:30 - 12:15",
        "speaker": "Bosco Román",
        "topic": "Early Thoughts on Robot Control and Interaction.",
        "image": "images/bosco.jpg",
        "abstract": "Robot swarms offer innovative solutions to modern challenges like large-area rescue and fire control. To scale without overwhelming communication channels, they must operate in a decentralized manner, relying on local interactions to achieve global goals. This raises a key question: what are the global effects of local errors, such as distance mismatches or data dropouts? Indeed, minor issues can escalate, leading to unintended and potentially harmful emergent behaviours. In this seminar, we’ll explore how to understand and potentially harness these, in principle unintended, emergent behaviours to improve swarm performance.",
        "bio": "Bosco Román earned his B.Sc. in Physics from the Complutense University of Madrid in 2024. He is currently working as a research assistant in the Swarm Systems Lab (ERC grant) at the University of Granada. His research is hosted by the Institute of Mathematics of Granada and supervised by Héctor García de Marina.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar13",
        "title": "Understanding Human Actions by Skipping Through Old YouTube.",
        "date": "2025-07-02",
        "time": "11:30 - 12:15",
        "speaker": "Ulas Sureyya Bingöl",
        "topic": "Understanding Human Actions by Skipping Through Old YouTube.",
        "image": "images/ulas.jpg",
        "abstract": "Understanding Human Actions by Skipping Through Old YouTube Based on CONCUR: Contrastive Observation Network with Cross-Video Understanding and Retrieval. We work on recognizing and localizing human actions in long, untrimmed videos—like the kind you’d randomly find on old YouTube. This is tricky when only the overall action label is known, without any info on when it happens. Our method, CONCUR, improves learning from such weak labels by comparing snippets both within the same video and across different ones. By aligning similar segments between videos and filtering out irrelevant parts, we help the model better understand where actions really occur. Tested on the THUMOS14 dataset, CONCUR outperforms existing methods by making smarter use of both temporal structure and video relationships.",
        "bio": "Ulas Bingöl earned a Master’s degree in Electrical and Electronics Engineering from Middle East Technical University, Turkey, in 2022. During his master's studies, he worked in robotics perception - localization while working as a software lead in an international logistics robotics company. After completing his degree, he continued working in the industry before transitioning to academia. He is currently pursuing a PhD in Computer Science at the University of Konstanz, where his research focuses on computer vision and deep learning.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar14",
        "title": "Automated Phytosensing: Ozone Exposure Classification Based on Plant Electrical Signals.",
        "date": "2025-03-12",
        "time": "13:15 - 13:35",
        "speaker": "Till Aust",
        "topic": "Automated Phytosensing: Ozone Exposure Classification Based on Plant Electrical Signals",
        "image": "images/Aust.png",
        "abstract": "In the WatchPlant project, we explore the potential of using a decentralized network of living plants as air-quality sensors by analyzing their electrophysiological responses—a concept known as phytosensing. We conducted in-lab experiments in which we expose ivy (Hedera helix) plants to ozone, an important pollutant to monitor, and measured their electrophysiological response. Because there is no well established automated way of detecting ozone exposure in plants, we propose a generic automatic toolchain that selects a high-performance subset of features and highly accurate models for plant electrophysiology. This approach derives plantand stimulus-generic features from the electrophysiological signal using the tsfresh library. Based on these features, we automatically select and optimize machine learning models using naive AutoML. We use forward feature selection to increase model performance. We show that our approach successfully classifies plant ozone exposure with accuracies of up to 94.6% on unseen data. We also show that our approach can be used for other plant species and stimuli. Our toolchain automates the development of monitoring algorithms for plants as pollutant monitors.",
        "bio": "Till Aust studied Robotics and Autonomous Systems at the University of Lübeck, where he earned both his Bachelor's and Master's degrees. He then joined the Cyber-Physical Systems Group led by Prof. Heiko Hamann as a PhD student, focusing on the analysis of physiological signals in bio-hybrid systems. His research contributes to the EU-funded projects WatchPlant and ChronoPilot, where he explores methods to interpret physiological data for controlling bio-hybrid systems and enabling feedback mechanisms.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar15",
        "title": "Automating Damage Recovery in a Legged Robot.",
        "date": "2025-03-12",
        "time": "13:35 - 13:55",
        "speaker": "Sindiso Mkhatshwa",
        "topic": "Automating Damage Recovery in a Legged Robot",
        "image": "images/Mkhatshwa.png",
        "abstract": "Autonomous robots are increasingly used in remote and hazardous environments, where automated recovery given damage to sensory-actuator systems would be extremely beneficial. Such robots must therefore have controllers that continue to function effectively given unexpected hardware malfunctions and damage. We evaluate various controller types (oscillator style central pattern generators and artificial neural networks), for producing adaptable gait behaviors. These controller types are run for hexapod robot gait control in concert with the Intelligent Trial and Error (IT&E) and Map-Elites algorithm to maintain behavioral diversity. Specifically, we investigate the impact of behavior map-size in MAP-Elites (the first phase of the IT&E algorithm), in company with various controller types for multiple leg failures scenarios using a simulated hexapod robot. Results support previous work demonstrating a trade-off between adapted gait speed and controller adaptability across leg-damage scenarios, where map-size is crucial for generating behavioral diversity required for adaptation.",
        "bio": "Sindiso Mkhatshwa earned a Master's degree in Computer Science from the University of Cape Town, South Africa, in 2023. He is currently pursuing a Ph.D. in Informatik at the Centre for the Advanced Study of Collective Behavior at the University of Konstanz, Germany. His research broadly focuses on collective decision-making in robot swarms.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar16",
        "title": "Bioinspired robotics: from biology to robotics and back.",
        "date": "2025-03-05",
        "time": "13:15 - 13:55",
        "speaker": "Liang Li",
        "topic": "Bioinspired robotics: from biology to robotics and back.",
        "image": "images/liang.jpg",
        "abstract": "With over half a billion years of evolutionary history, fish swim with high efficiency, great agility, and surprising stealth in the three-dimensional aquatic environment. Therefore, it is undoubtedly natural for engineers to turn to fish as a source of new ideas on underwater propulsive systems. Over the past decades, roboticists, inspired by these biological systems, have constructed various fish-like robots that copy real fish morphology, locomotion, and movement. Recently, the direction of bio-inspiration has started to flip to bio-understanding—using robotics in engineering to help answer questions in biology. In this talk, I will first introduce how we construct and control the robotic fish following the paradigm of bio-inspiration. Then, I will give examples of applying real and virtual robots to help us explore why and how do fish school. Finally, I will briefly introduce my ongoing and future work in bio-inspiration and bio-understanding.",
        "bio": "Liang Li is a Group Leader (PI) at the Max-Planck Institute of Animal Behavior and the University of Konstanz. He received a bachelor's degree in automation from Chongqing University in 2011 and a PhD in general mechanics and foundation of mechanics from Peking University in 2017. From February 2017 to June 2024, he was a Postdoctoral Research Fellow and Project Leader in the Department of Collective Behaviour, Max Planck Institute of Animal Behavior, Konstanz, Germany. His research interests include bio-inspired robots, swarm robots, collective behaviour in hybrid animal-robot systems, and bio-fluid dynamics in fish schools. He has published interdisciplinary studies in more than 46 peer-reviewed journals, including Nature Communications and PNAS. He also serves as a reviewer for these journals. He is an IEEE senior Member, received the Messmer Foundation Award, the Best Poster Award at the Conference on Robots for Science organized by Science Robotics, and secured multiple grants to pursue research into developing and applying robots for studying biological phenomena.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar17",
        "title": "Who works harder today? Allocating agents efficiently among several tasks of heterogeneous difficulty.",
        "date": "2025-02-19",
        "time": "13:15 - 13:55",
        "speaker": "Simay Atasoy",
        "topic": "Who works harder today? Allocating agents efficiently among several tasks of heterogeneous difficulty.",
        "image": "images/simay.png",
        "abstract": "In collective systems, efficient task allocation is crucial to maximize group performance, especially when agents face many tasks with heterogeneous difficulties. In such scenarios, an allocation strategy needs to balance both various task difficulties and available agents as a limited resource. Difficult tasks may require more agents to achieve similar accuracies across tasks, but a limited amount of agents requires careful allocation for high overall performance. We propose an algorithm for allocating agents to tasks with various difficulties to achieve maximum accuracy.",
        "bio": "Simay Atasoy earned a Master’s degree in Electrical and Electronics Engineering from Middle East Technical University, Turkey, in 2022.During her master's studies, she worked in the robotics research and development department of a company. After completing her degree, she continued working in the industry before transitioning to academia. She is currently pursuing a PhD in Computer Science at the University of Konstanz, where her research focuses on collective decision making and task allocation.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar18",
        "title": "More dominant baboons have less and lower quality sleep.",
        "date": "2025-02-12",
        "time": "13:15 - 13:55",
        "speaker": "Marco Fele",
        "topic": "More dominant baboons have less and lower quality sleep.",
        "image": "images/marco.png",
        "abstract": "The amount and quality of sleep individuals get can impact various aspects of human and non-human animal health, ultimately affecting fitness. For wild animals that sleep in groups, individuals may disturb one another, influencing sleep quality and quantity, but this aspect of social sleep has been understudied due to methodological challenges. Here, we test the hypothesis that an individual's social dominance can affect sleep opportunities, by studying sleep patterns in a troop of wild chacma baboons (Papio ursinus), a species with a strong hierarchical social structure. First, we show that the troop’s night-time sleep (determined by 40Hz acceleration data) is highly synchronised. Next, we link night-time sleep dynamics to daytime spatial networks and dominance hierarchy (from 1Hz GPS data and direct observations). We show that baboon sleep synchrony is higher between similarly ranked individuals, and unexpectedly, more dominant baboons experience less and lower-quality sleep. We propose that this hierarchy effect is explained by higher-ranked baboons resting closer to more group members, which also leads them exerting greater influence on each other’s night-time behaviour compared to lower-ranked individuals. Our study provides the first empirical evidence for the impact of social hierarchies on sleep in a wild primate, suggesting that dominance status may impose trade-offs between social rank and the quality and quantity of sleep.",
        "bio": "Marco Fele is a third-year PhD student in Animal Collective Behaviour at Swansea University, Wales. His research interests include understanding how individual differences, such as social dominance rank, influence collective movement and activity synchronization. During his research visit at CASCB, he will develop a model of collective decision-making within the framework of signal detection theory, exploring scenarios where individuals have varying quorum thresholds.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar19",
        "title": "Emergent Collective Behavior in Multi-Agent Systems Through Predictive Coding.",
        "date": "2025-02-05",
        "time": "13:15 - 13:55",
        "speaker": "Nicolas Bessone",
        "topic": "Emergent Collective Behavior in Multi-Agent Systems Through Predictive Coding.",
        "image": "images/bessone.png",
        "abstract": "Predictive coding has emerged as a compelling framework for understanding perception and action in biological and artificial agents. In this work, we explore the implications of predictive coding in a multi-agent system, where each agent moves in a continuous environment and continuously predicts its future state based on sensory inputs. Agents minimize their prediction error by adapting their movement, leading to emergent collective behaviors such as aggregation, cohesion, and obstacle avoidance. Through simulations, we investigate how these behaviors arise from local predictive mechanisms without the need for explicit coordination or predefined interaction rules. Our results show that predictive coding not only enables individual agents to navigate their environment efficiently but also fosters self-organized collective structures that resemble swarm-like behavior observed in natural systems. The findings suggest that predictive coding can serve as a powerful principle for designing distributed intelligent systems capable of adaptive and emergent coordination.",
        "bio": "Nicolas Bessone is a PhD student at the IT University of Denmark, focusing on decentralized controllers for distributed systems and a multitude of side projects that range from agent-based modeling and music theory representations in computational spaces to neuroscience, physics, and artificial intelligence.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar21",
        "title": "Complex Systems and Music: Network representations and the emergent orchestra.",
        "date": "2025-01-22",
        "time": "14:10 - 14:50",
        "speaker": "Lluc Bono Rosselló",
        "topic": "Complex Systems and Music: Network representations and the emergent orchestra.",
        "image": "images/Lluc_Bono.png",
        "abstract": "In music, a random sequence of notes fails to capture our attention, while a monotonous four-note repetition quickly loses its appeal. So, what is it about certain musical structures that strikes the perfect balance between predictability and surprise? In this talk, I will introduce two complementary approaches from the field of complex systems to explore how these structures and interactions emerge. From a top-down perspective, I will show how network representations can be used to map and analyse patterns within musical pieces. From a bottom-up perspective, I will show how simple local interactions can lead to the emergence of richer, coordinated musical forms in a swarm of robots, as illustrated in our work with the Emergent Orchestra framework.",
        "bio": "Lluc Bono Rosselló is a PhD student at IRIDIA, Université Libre de Bruxelles (Belgium). His research focuses on studying creativity from a complex systems perspective, primarily using tools from network science and swarm intelligence. He holds a degree in Industrial Engineering from Valencia (Spain) and a Master’s in Computer Science and Engineering from ULB. Alongside his research, he has also contributed to more applied AI projects, such as a pilot initiative for the Brussels Region to automatically detect illegal animal sales and the development of an intelligent chatbot for the university using Large Language Models.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar22",
        "title": "Safe Robot Swarms: Methods to Prevent, Detect, and Mitigate Faults.",
        "date": "2025-01-08",
        "time": "13:15 - 13:55",
        "speaker": "Suet Ying Lee",
        "topic": "Safe Robot Swarms: Methods to Prevent, Detect, and Mitigate Faults.",
        "image": "images/suet.png",
        "abstract": "Robot swarms are susceptible to failure - both at the level of an individual robot and the swarm as a collective. Developing methods for fault detection, diagnosis and recovery (FDDR) will therefore be critical for successful deployment in real-world applications. My work focuses largely on data-driven methods for FDDR in swarms, methods which allow individuals to self-detect faults or to mitigate their impact on overall swarm performance. Additionally, in collaborative work, we design data-centric processes for the assurance of safe swarm behaviour, bridging the gap between experimental results and real-world safety requirements.",
        "bio": "Suet Lee earned an integrated Master’s degree in Mathematics from Imperial College London, UK. Since then she has worked in industry in the fields of software development and robotics, before returning to academia to complete a PhD in Swarm Robotics at the University of Bristol, Hauert Lab. Suet is currently a postdoctoral researcher at the University of Konstanz in the Cyber-Physical Systems group.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar23",
        "title": "The Geometry of Decision Making in Robotic Swarms.",
        "date": "2024-12-11",
        "time": "13:30 - 14:10",
        "speaker": "Sindiso Mkhatshwa",
        "topic": "The Geometry of Decision Making in Robotic Swarms.",
        "image": "images/Mkhatshwa.png",
        "abstract": "Recent research suggests that when choosing among spatially distributed options, the brain repeatedly breaks multichoice decisions into a series of binary decisions in space–time. While previous studies have utilized fruit flies, desert locusts, and larval zebrafish to explore these fundamental geometric principles, we employ swarm robotics as a testbed to investigate how and why animals exhibit specific movement patterns.",
        "bio": "Sindiso Mkhatshwa earned a Master's degree in Computer Science from the University of Cape Town, South Africa, in 2023. He is currently pursuing a Ph.D. in Informatik at the Centre for the Advanced Study of Collective Behaviour at the University of Konstanz, Germany. His research broadly focuses on collective decision-making in robot swarms.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar24",
        "title": "Can we study how bats echolocate in swarms?",
        "date": "2024-12-05",
        "time": "13:30 - 14:10",
        "speaker": "Alberto Doimo",
        "topic": "Can we study how bats echolocate in swarms?",
        "image": "images/albertodoimo.jpg",
        "abstract": "Inspired by bats, the \"Ro-Bat\" platform uses only microphones to perceive complex, multi-source acoustic environments, providing biologists with a tool to study active localization agents like bats or robots within a swarm. This presentation will discuss the development of a passive echolocation system for autonomous swarm robots.",
        "bio": "Alberto Doimo is a Master's student in Acoustic Engineering at Politecnico di Milano, specialised in audio signal processing and echolocation. He is also a contributor to The Sound of Bees project at CASCB, to develop a way to record the Stop signal inside beehives.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar25",
        "title": "The role of interaction networks in decision-making processes for decentralized agent-based systems.",
        "date": "2024-12-04",
        "time": "12:00 - 12:40",
        "speaker": "Fabio Oddi",
        "topic": "The role of interaction networks in decision-making processes for decentralized agent-based systems.",
        "image": "images/fabiooddi.jpg",
        "abstract": "Quorum sensing is a fundamental mechanism that enables coordinated behavior within populations of autonomous agents and is widely studied in biological systems, from bacterial colonies to social insects. In swarm robotics, quorum sensing has attracted significant interest, primarily for implementing collective decision-making processes. This work explores the potential of leveraging quorum sensing to enable robotic swarms to adapt to dynamic environments in the context of the Best-of-N decision-making problem. The study aims to identify the most effective approach for this application, taking into consideration two widely adopted agent models in this context.",
        "bio": "Fabio Oddi earned a Master's degree in Control Engineering from Sapienza University of Rome, Italy, in 2022. He is currently pursuing a Ph.D. in Computer Science Engineering at the same institution, with his research funded by the Institute of Cognitive Sciences and Technologies of the National Research Council (ISTC-CNR). His research focuses on exploring the role of interaction networks in decision-making processes for decentralized agent-based systems.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar26",
        "title": "The evolutionary ecology of decision-making.",
        "date": "2025-07-09",
        "time": "11:30 - 12:15",
        "speaker": "Vivek Sridhar",
        "topic": "The evolutionary ecology of decision-making.",
        "image": "images/vivek_sridhar.jpeg",
        "abstract": "My research uncovers fundamental algorithms by which brains interpret complex environments and make adaptive decisions, bridging neural, individual, and collective levels of organization. In today’s seminar, I will talk about my past work studying how animals choose among spatially distributed options. Combining theory and high-throughput experiments in virtual reality systems, I showed that brains handle environmental complexity by breaking down multi-choice decisions to sequential binary decisions. I’m now transporting these insights from the lab to the field, where I study how the spatial configuration and geometry of male territories influences female mate-choice in blackbuck (Antilope cervicapra), an antelope endemic to the Indian subcontinent.",
        "bio": "Vivek is an Assistant Professor at the University of Washington and an affiliate researcher at the Max Planck Institute of Animal Behavior. His research explores the fundamental principles underlying spatiotemporal computation in biology, with a particular focus on the mechanisms driving animal movement, navigation, and decision-making. As a mixed-media artist and alumnus of the »Field Trip« residency in Akademie Schloss Solitude, he also collaborates with artists to offer distinct perspectives on science and the natural world.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar29",
        "title": "Seeing more by seeing less: uninformed individuals can enhance collective sensing of dynamic environments. [LONG SCYPHY]",
        "date": "2025-07-23",
        "time": "10:45 - 12:15",
        "speaker": "Mohammad Nomaan Husain",
        "topic": "Seeing more by seeing less: uninformed individuals can enhance collective sensing of dynamic environments. [LONG SCYPHY]",
        "image": "images/nomaan.jpeg",
        "abstract": "We studied how heterogeneous swarms, composed of informed and uninformed robots, can collectively solve the best-of-n decision-making problem in dynamic and noisy environments. Inspired by the biological systems, our model explores how uninformed robots, which cannot make environmental observations and rely solely on social information from their neighbours, influence group consensus. We find that under specific noise conditions, the inclusion of uninformed robots improves swarm performance, though this often comes at the tradeoff of slower coherence. These findings highlight the importance of heterogeneity to improve performance in collective decision-making and also present the tradeoffs that come with it.",
        "bio": "Mohammad Nomaan Husain is a master’s student in Computer and Information Science at the University of Konstanz, currently completing his thesis under the supervision of Andreagiovanni Reina. His interest in swarm behavior began through advanced courses on swarm robotics and collective behavior taught by Prof. Heiko Hamann, as well as a seminar on heterogeneous swarms of voter and majority-rule robots employing cross-inhibition. His thesis continues this line of research, using swarm robotics to investigate mechanisms of collective behavior.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar30",
        "title": "From Soft Robotics to Swarming Fish: Bio-Inspired Robotic Design",
        "date": "2025-07-30",
        "time": "11:30 - 12:15",
        "speaker": "Hun Jang",
        "topic": "From Soft Robotics to Swarming Fish: Bio-Inspired Robotic Design",
        "image": "images/Hun_Jang.png",
        "abstract": "My research has primarily focused on the mechanical design of robots, especially soft robotics. During my master’s program, I developed wearable tactile sensors capable of recognizing surface textures, which were integrated into a full-body humanoid system and presented at the ANA Avatar XPRIZE 2022 competition. I later extended my work to soft gripper systems, leveraging the inherent compliance of soft materials to enable both effective and safe grasping.",
        "bio": "Hun Jang worked at AIRO, Inc., where he contributed to the mechanical design of bio-inspired robotic fish. This experience deepened his interest in understanding aquatic locomotion and the complex relationship between robots and living animals. Motivated by the interplay between biology and engineering, he have recently joined the research group led by Dr. Liang Li and Prof. Dr. Iain Couzin, where he aims to investigate marine animal's collective behaviour by utilizing robotic system. His research will explore both the underlying beauty and functional aspects of collective animal behavior through experimental studies and bio-inspired design with robotic system.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar31",
        "title": "Where Seeing Is Believing: Enabling Humans to Read the Rules Behind Swarm Behaviour.",
        "date": "2025-08-06",
        "time": "11:30 - 12:15",
        "speaker": "Khulud Alharthi",
        "topic": "Where Seeing Is Believing: Enabling Humans to Read the Rules Behind Swarm Behaviour.",
        "image": "images/khulud_alharthi.jpg",
        "abstract": "Swarm systems exhibit complex behaviour that emerges from simple local interactions, yet deciphering these underlying rules remains a challenging task. This talk presents a method that extracts human-readable behaviour tree controllers directly from video demonstrations of swarm behaviours. By bridging the gap between emergent collective behaviour and local agent rules, this approach empowers engineers to design and control swarm systems while providing biologists with automatic ways to generate testable hypotheses from observed natural swarms. From simulated robots and real robots to ant colonies, we elevate \"seeing\" swarm behaviour to reveal deeper insights and facilitate practical design and control.",
        "bio": "Khulud Alharthi holds a Master’s degree in Computer Science and earned her PhD in Swarm Robotics from the University of Bristol, where she conducted research in the Hauert Lab. She is currently a postdoctoral researcher at the University of Bristol’s Data Science Lab. Following her postdoctoral work at the University of Bristol, she will return to Saudi Arabia to take up her role as Assistant Professor in the Department of Computer Science at Taif University.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar32",
        "title": "Boat vs. Duck: A Multimodal Approach to Obstacle Detection",
        "date": "2025-08-13",
        "time": "11:30 - 11:37",
        "speaker": "Margaret Lee",
        "topic": "Boat vs. Duck: A Multimodal Approach to Obstacle Detection",
        "image": "images/margaret_lee.jpg",
        "abstract": "Most autonomous sailboats don’t have dedicated obstacle avoidance systems. For autonomous research data collection in an environment as busy as Lake Constance, we feel that obstacle avoidance is essential to protect the swarm of sailboat robots as well as others on the water. This talk presents an approach to detecting and avoiding boats, people, piers, and, yes, ducks in every condition the vessels might encounter during a week-long research mission. The system fuses thermal imaging, RGB video, and mmWave radar into a single integrated module, tested in a variety of weather conditions both day and night, that can flag sail headings that could lead to a collision.",
        "bio": "Margaret Lee is earning a BASc in Engineering Physics at the University of British Columbia in Vancouver, Canada. She got her start in robotics building autonomous sailboats at her university and has been pursuing robotics projects ever since. She is currently hosted at the University of Konstanz through the DAAD RISE program under her supervisor, Pranav Kedia.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar33",
        "title": "Using Plants as Sensors",
        "date": "2025-08-13",
        "time": "11:38 - 12:15",
        "speaker": "Leon Katsnelson",
        "topic": "Using Plants as Sensors",
        "image": "images/leon_katsnelson.jpeg",
        "abstract": "Plants react dynamically to their environment. Changes in temperature, light, and much more trigger action potentials, which can be measured and used to infer information about a plants' surroundings. Following up on work from the pan-European Watchplant project, I worked on identifying temperature conditions given voltage readings from tomato plants, using various machine learning methods.",
        "bio": "Leon Katsnelson is studying towards his Bachelor's degree in Computer Engineering at the University of Manitoba, in Canada. He is currently working with Eduard Buss at the Cyber-Physical Systems lab at the University of Konstanz on connecting plant biosignals to the impulses that provoke them, with funding support from DAAD.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar34",
        "title": "Plasticity in decision-making across space and time",
        "date": "2025-08-20",
        "time": "11:30 - 12:15",
        "speaker": "Maya Dagher",
        "topic": "Plasticity in decision-making across space and time",
        "image": "images/maya_dagher.webp",
        "abstract": "Ring attractors are neural circuit motifs that encode continuous variables such as heading direction, with growing evidence supporting their role in flexible decision-making. I’ll be talking about some simulation and mean-field based approaches to exploring the effects of learning in ring attractor networks over distinct time-scales - from rapid, short-term adaptation to slower, experience-dependent reconfiguration. I’ll also be discussing some information theoretic methods I am employing to infer the angular structure of social influence in swarms. This work aims to use trajectory data of animal collectives to directly analyze the macro-scale effects of ring attractor-driven individual navigation strategies.",
        "bio": "Maya Dagher is a doctoral student in the International Max Planck Research School for Quantitative Behaviour, Ecology, and Evolution. She studied physics at McGill University and her research interests are the role of plasticity in decision-making and finding links to these decision algorithms in the structure of animal collectives.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar35",
        "title": "Obstacle-Aware Shepherding of Non-Cohesive Agents Via Local Control Rules",
        "date": "2025-08-27",
        "time": "11:30 - 12:15",
        "speaker": "Cinzia Tomaselli",
        "topic": "Obstacle-Aware Shepherding of Non-Cohesive Agents Via Local Control Rules",
        "image": "images/cinzia_tomaselli.jpg",
        "abstract": "We present a reactive control strategy for herding non-cohesive agents toward a goal region in obstacle-rich environments. Unlike traditional flocking-based approaches that assume cohesive group behavior, our method addresses scenarios where targets do not naturally coordinate with each other. The control strategy uses reactive components that enable herders to simultaneously navigate around static convex obstacles and guide individual targets toward the goal while maintaining collision avoidance. By eliminating the need for global path planning, our approach offers computational efficiency and real-time adaptability. Simulation results demonstrate superior performance compared to traditional flocking-based methods in cluttered environments, particularly when targets exhibit non-cohesive behavior, indicating strong potential for deployment in complex real-world scenarios.",
        "bio": "Cinzia Tomaselli received her Bachelor's degree in Electronic Engineering and her Master's degree in Automation Engineering and Control of Complex Systems from the University of Catania, Italy, in 2019 and 2021, respectively. She obtained her Ph.D. in Systems, Energy, Computer, and Telecommunications Engineering from the same university in 2024, under the supervision of Prof. Mattia Frasca and Prof. Lucia Valentina Gambuzza. She is currently a postdoctoral researcher at the Scuola Superiore Meridionale in Naples, Italy, working under the supervision of Prof. Mario Di Bernardo. Her research interests include the analysis and control of multi-agent systems, with a focus on collective behaviors shaped by interaction networks, as well as active control strategies such as shepherding, with applications in swarm robotics.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar36",
        "title": "Robotic Foraging: From Simulation to Reality and Back",
        "date": "2025-09-10",
        "time": "11:30 - 12:15",
        "speaker": "Raj Ammu",
        "topic": "Robotic Foraging: From Simulation to Reality and Back",
        "image": "images/raj_ammu.jpeg",
        "abstract": "One of the critical challenges in applied robotics is transferring controllers synthesized in simulation to real-world platforms. This talk presents our effort to bridge the sim-to-real gap by adapting TurtleBot 4 robots to perform a collective foraging task inspired by leaf-cutter ants. As a baseline, we developed a finite state machine framework that integrates multiple perception and control technologies. These include on-board sensors (LiDAR, light sensors, infrared), real-time robot tracking, closed-loop control, and preliminary swarm coordination. Together, these components enable the robots to accomplish the foraging task in the physical world. This work will form the foundation for the future seamless transfer of various controllers, such as Artificial Neural Networks or Behaviour Trees, from simulation to reality.",
        "bio": "Raj Ammu is currently working towards his MEng degree in Mechatronics and Robotic Engineering at the University of Sheffield in the UK. He is currently working with Paolo Leopardi on transferring controllers synthesised in simulation into the real world. He is hosted at the University of Konstanz this summer through the DAAD RISE Germany program. ",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar37",
        "title": "End to end vision-based swarm robot control",
        "date": "2025-09-17",
        "time": "11:30 - 12:15",
        "speaker": "Ruiheng Wu",
        "topic": "End to end vision-based swarm robot control",
        "image": "images/ruiheng_wu.jpeg",
        "abstract": "Swarm robotics, inspired by the collective behaviors found in nature, plays a vital role in enhancing scalability, resilience, and efficiency in multi-robot systems. A major challenge in deploying swarm robotics on a large scale is enabling robots to determine their neighbors' relative positions using onboard sensors, mimicking the spatial awareness observed in animal groups. Current onboard methods, such as SLAM, require intensive computation and are not ideal for decoding neighbor information. On the other hand, combining artificial neural networks with computer vision can be effective when trained on large high-quality datasets, but collecting such datasets remains the primary bottleneck. In this seminar, I propose a general pipeline that simplifies the collection of large training datasets and enables detection with lightweight neural networks to estimate the neighbor's relative position with minimum manual work. As a demonstration, we deploy seven robots equipped with onboard cameras and Raspberry Pi 4B units, using a motion capture system to label neighbors' relative positions synchronized with the onboard images. By collecting more than 10,000 images in just 10 minutes, we train and compare three neural networks to estimate the neighbor's relative position. Our pipeline highlights the feasibility of onboard perception and control with scalable large swarm robotics, offering promising prospects for deployment beyond the lab environment.",
        "bio": "TBD",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar38",
        "title": "Decoding Collective Migration with Information Theory",
        "date": "2025-09-24",
        "time": "11:30 - 12:15",
        "speaker": "Udoy Basak",
        "topic": "Decoding Collective Migration with Information Theory",
        "image": "images/udoy_basak.jpeg",
        "abstract": "Understanding collective behavior in animal groups requires quantitative frameworks that can capture how information is generated, shared, and transmitted among individuals. This talk introduces a suite of information-theoretic measures, beginning with Shannon entropy as the foundation for quantifying uncertainty. The discussion then develops through conditional entropy and mutual information, which characterize dependencies between agents. Extending these ideas to temporal dynamics, time-delayed mutual information measures coupling across time, while transfer entropy serves as a directional, time-asymmetric tool for identifying effective information flow. The main emphasis is on the theoretical underpinnings of these measures and their interconnections, with applications to key problems in collective animal behavior, such as detecting interaction structures, revealing leader–follower dynamics, and mapping the flow of information underlying coordinated movement. ",
        "bio": "I am investigating the collective movement of locusts using individual tracking of agents and incorporating information theory to infer different causal interactions that constitute the collective migration of locusts. In another approach, I also use the Eulerian framework, specifically Particle Image Velocimetry (PIV), to describe the macroscopic flow patterns in locust swarms. By combining causality analysis from information theory with PIV-based flow characterization, I aim to uncover the underlying principles governing active turbulence in collective migration.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar39",
        "title": "Robots and Time: Synthesizing Timescales for Embodied Artificial Systems",
        "date": "2025-10-01",
        "time": "11:30 - 12:15",
        "speaker": "Suet Lee",
        "topic": "Robots and Time: Synthesizing Timescales for Embodied Artificial Systems",
        "image": "images/suet.png",
        "abstract": "TBD",
        "bio": "Suet Lee earned an integrated Master’s degree in Mathematics from Imperial College London, UK. Since then she has worked in industry in the fields of software development and robotics, before returning to academia to complete a PhD in Swarm Robotics at the University of Bristol, Hauert Lab. Suet is currently a postdoctoral researcher at the University of Konstanz in the Cyber-Physical Systems group.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar40",
        "title": "RO-BAT, a bat-inspired robot swarm for audio-driven navigation",
        "date": "2025-10-15",
        "time": "11:30 - 12:15",
        "speaker": "Alberto Doimo",
        "topic": "RO-BAT, a bat-inspired robot swarm for audio-driven navigation",
        "image": "images/albertodoimo.jpg",
        "abstract": "Animals provide unique sources of inspiration for robotics, particularly species that rely on non-visual sensing modalities to navigate complex environments. Among them, bats constitute a remarkable model system: they achieve agile flight and coordinated collective motion by relying exclusively on echolocation even within dense swarms where numerous overlapping acoustic signals give rise to the so-called Cocktail Party Problem. Amazed by the ability of bats to navigate and coordinate collectively through sound alone, we developed RO-BAT, a bio-inspired robotic platform designed to investigate how sound-based sensing can be translated into robotic systems for navigation and swarm coordination. The first stage of the project focused on passive sound localisation, in which the robot localises external sound sources without emitting its own signals. Drawing inspiration from bats’ ability to estimate the direction of arrival (DOA) of acoustic cues, a microphone array was integrated with a Raspberry Pi and a sound card to enable real-time, onboard signal processing for obstacle avoidance. Three DOA algorithms were implemented and evaluated in controlled experiments, achieving reliable obstacle avoidance in dynamic multi-agent scenarios. This work established a proof of concept for sound-only navigation in robots, demonstrating particular value when visual sensing is unreliable or unavailable. Building on this foundation, the second stage implemented active echolocation, equipping the RO-BAT with an ultrasonic transducer for emission and a custom-built microphone array optimised for ultrasound localisation. A signal processing pipeline was developed to extract both range and angular information from echoes. Several DOA algorithms were tested and Delay-and-Sum (DAS) was selected for its computational efficiency. Laboratory experiments confirmed that the robot could autonomously avoid obstacles using only its self-generated acoustic cues, effectively reproducing the core principles of bat echolocation on a robotic platform. The current implementation of a single functioning RO-BAT—developed in both its passive and active configurations—is now being scaled up into a swarm of autonomous, decentralised agents. This swarm of individually controlled RO-BATs is already capable of navigating cluttered environments acoustically, without relying on any other sensory cues. By modelling both passive and active acoustic localisation, the RO-BAT platform demonstrates a biologically inspired approach to robotic navigation and swarm coordination. Its design highlights how bats’ natural strategies for managing overlapping acoustic signals can lead to scalable, resource-efficient sensing solutions for robotics. This work not only contributes to the study of collective bioacoustics in natural systems, but also paves the way for robust swarm robotic navigation in challenging environments.",
        "bio": "Alberto Doimo is a Master's student in Acoustic Engineering at Politecnico di Milano, specialised in audio signal processing and echolocation. He is also a contributor to The Sound of Bees project at CASCB, to develop a way to record the Stop signal inside beehives.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar41",
        "title": "Robot Navigation with Optic Flow",
        "date": "2025-10-08",
        "time": "11:30 - 12:15",
        "speaker": "Vassil Radoynovski",
        "topic": "Robot Navigation with Optic Flow",
        "image": "images/placeholder_chatgpt.png",
        "abstract": "TBA",
        "bio": "TBA",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar42",
        "title": "Be a MeSS: BioMimetic Sailboat Swarm",
        "date": "2025-03-19",
        "time": "13:15 - 13:35",
        "speaker": "Pranav Kedia",
        "topic": "Be a MeSS: BioMimetic Sailboat Swarm",
        "image": "images/pranav_kedia.jpg",
        "abstract": "TBA",
        "bio": "Hello! I'm Pranav Kedia, a Ph.D. researcher at the cyber physical group supervised by Prof. Dr. Heiko Hamann at the University of Konstanz, where I'm affiliated with the Centre for the Advanced Study of Collective Behaviour. I am working on a swarm of autonomous sailboats optimized for long-duration endurance. This research has been a combination of learning about sailing and applying my skills and knowledge in Embedded systems and Robotics. Previously, I worked on Bee Waggle Robot in the EU H2020 project 'Hiveopolis' at the Biorobtics Lab led by Prof. Dr. Tim Landgraf at the Free University of Berlin. I completed my master's majoring in electronics and communication with a specialization in embedded systems at IIIT-B. Previously, I was fortunate to be part of the Surgical and Assistive Robotics Lab, led by Prof. Madhav Rao. I was also part of the ARMS lab, led by Dr. Arpita Sinha at IIT Bombay, India, in the summer of 2019. Prof. Sachit Rao had supervised me on guided coursework and non-course projects. I enjoy working on Bio-inspired Swarm Robotics and Swarm Intelligence methods.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar43",
        "title": "Describing the burst-and-glide movement of fish by modulating a ring attractor with neuro-inspired spiking dynamics",
        "date": "2025-03-26",
        "time": "13:15 - 13:35",
        "speaker": "Marco Fele",
        "topic": "Describing the burst-and-glide movement of fish by modulating a ring attractor with neuro-inspired spiking dynamics",
        "image": "images/marco.png",
        "abstract": "Oscillatory dynamics are widespread in animal behaviour. For example, fish periodically increase their swimming speed resulting in a burst-and-glide movement pattern. Following recent studies, we propose a potential functional interpretation to this behaviour by noting that a similar neuro-inspired oscillatory system has favourable decision-making properties. By coupling via non-linear feedbacks a slow variable describing responsiveness to inputs to a set of faster decision variables, a decision-making system can go through periodic cycles of \"exploration\" (gathering evidence) and \"exploitation\" (executing a decision), which emerge intrinsically from the system's dynamics. In this way, decisions are made constantly  \"on the go\", and an individual flexibly and adaptively adjusts to changes in the decisions' landscape. Furthermore, the decision-making system exhibits favourable properties such as spontaneous decisions in the absence of evidence, symmetry-breaking, and is constantly brought back to a state of ultra-sensitivity to the options' qualities. Such properties can be co-opted to develop a bio-inspired control design for effectively guiding the spatial navigation of an artificial agent. In this project, I am expanding a ring attractor model by adding neuro-inspired oscillatory behaviour. The aim is to use this model to potentially describe burst-and-glide movement in fish, and efficiently guide the navigation of a robot through its environment.",
        "bio": "I am a third-year PhD student in animal collective behaviour at Swansea University (Wales), currently working on primates. I am interested in how individual differences like social dominance rank effect collective movement and activity synchronization. During my research visit at CASCB, I am developing a model of burst and glide movement in fish with the aims of describing repeated decision-making and developing a bio-inspired control design for the navigation of an artificial agent.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar44",
        "title": "From vision to action: visuo-motor coordination and adaptive control in hovering hawkmoths",
        "date": "2025-11-26",
        "time": "11:30 - 12:15",
        "speaker": "Lochlan Walsh",
        "topic": "From vision to action: visuo-motor coordination and adaptive control in hovering hawkmoths",
        "image": "images/lochlan_walsch.jpg",
        "abstract": "For a hovering hawkmoth, feeding poses a challenging control problem: the flower moves, the air swirls, and yet the proboscis must be precisely guided to the flower's nectary. Despite this challenge, hawkmoths perform exceptionally well at coordinating their flight movements and proboscis control, with millimetre precision. The hummingbird hawkmoth, Macroglossum stellatarum, serves as an ideal model to investigate the continuous sensing-action loop in flower interactions, as they use visual information to guide movement, which in turn reshapes their sensory input. In this seminar, I will share how we quantify the movements and sensory input of freely flying hawkmoths using high-speed videos and markerless tracking. Then, I will introduce our findings that hawkmoths display individualized strategies of controlling their proboscis while searching for a nectary, using solely visual information. Finally, I will discuss the visuo-motor coordination between the eyes and the proboscis, the plasticity of such systems, and future work in active sensing strategies.",
        "bio": "Lochlan is a PhD student at the University of Konstanz with the IMPRS-QBEE, in the Visual Insect Neuroethology Group. He holds a BSc Cognitive Systems from the University of British Columbia, and MSc Animal Behaviour from the University of St Andrews. His research concerns using modern tracking tools to investigate the active sensing and sensorimotor control of freely behaving animals, with an emphasis on visually-guided behaviours.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar45",
        "title": "The Swarm's Echo: Collective Intelligence in Research, Art, and Environmental Action",
        "date": "2025-11-05",
        "time": "11:30 - 12:15",
        "speaker": "Avgi Stavrou",
        "topic": "The Swarm's Echo: Collective Intelligence in Research, Art, and Environmental Action",
        "image": "images/agvi_stavrou.webp",
        "abstract": "Decentralised coordination principles unite theory, art, and practice. Emerging from multi‑agent learning research, these principles are rendered tangible through CA::VE's immersive installations, where human swarms enact emergence and operationalised in sustainable robotics via PROTEAS. The presentation demonstrates how collective intelligence, designed through simple local rules, generates resilient systems across distributed learning systems, public engagement, and environmental responsibility.",
        "bio": "Avgi Stavrou is a researcher in distributed multi-agent systems, focusing on collective behaviours that emerge from them. She is completing her PhD at the FARSCOPE CDT at UoB/UWE. Her research explores the principles of intelligence, emergent behaviour, game theory, and decision-making dynamics, developing mathematical frameworks for decentralised coordination strategies in dynamic environments. Co-founding CA::VE (Collective Audio-Visual Emergence), translates complex systems into immersive experiences, with the project \"The Forest\" inviting audiences to generate audio-visual ecosystems illustrating emergence and feedback loops. Additionally, she co-founded PROTEAS, which employs robotics to confront environmental issues and encourage sustainable practices.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar46",
        "title": "Visual Mechanisms Underlying Conspecific Collision",
        "date": "2025-11-12",
        "time": "11:30 - 12:15",
        "speaker": "Chi-Yü Lee",
        "topic": "Visual Mechanisms Underlying Conspecific Collision",
        "image": "images/chi_yu.jpg",
        "abstract": "A fundamental issue in animal migration is how to keep moving without crushing nearby conspecifics. Vision provides instant information about the motion of an animal itself and nearby conspecifics to adjust behaviours accordingly. Despite limited number of neurons in the nervous system, the monocular vision in locusts can predict when crushing occurs and trigger defensive behaviours, which makes it a valuable model to explore the underlying mechanism. I will talk about the working hypothesis and outlook on this project.",
        "bio": "Chi-Yü Lee is a doctoral student in the International Max Planck Research School for Quantitative Behaviour, Ecology, and Evolution. He holds a Bachelor degree in Bio-resource Sciences from University of Tsukuba and Master of Philosophy in Experimental Psychology from University College London. His research concerns neural computation behind conspecific interaction.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar47",
        "title": "A Concept for Imitation Learning on a TurtleBot Swarm [Remote Seminar]",
        "date": "2025-11-19",
        "time": "11:30 - 12:15",
        "speaker": "Mattes Kraus",
        "topic": "A Concept for Imitation Learning on a TurtleBot Swarm [Remote Seminar]",
        "image": "images/mattes_kraus.webp",
        "abstract": "In classical Reinforcement Learning settings, to achieve good results, one needs to provide a performance measure in the form of a reward function. This can be difficult. With what number would you reward a self-driving car dodging a kid? And compared to that, how well did a car reach the goal on time? It is difficult to transfer common sense into numbers, especially since in RL, maximising this function also needs to lead to the desired behaviour. It is far more intuitive to simply demonstrate the desired behaviour, which is the core idea behind Imitation Learning. I am going to present you a way to do imitation learning for a swarm of turtle bots, achieving learning behaviours like random walk, standing still, aggregating, and dispersion, only from demonstrating the desired behaviour in a self-written demonstration and simulation tool. This covers the whole pipeline, from demonstrating the behaviour in simulation, to learning that behaviour in simulation, and lastly deploying the policies on a real TurtleBot swarm.",
        "bio": "Mattes is in his master’s at Technical University of Munich, studying Robotics, Cognition, Intelligence. He completed his B.Sc. in Computer Science at the University of Konstanz, doing his thesis with Jonas Kuckling. Between his Bachelor’s and Master’s, he kept working as a student researcher with Jonas, which resulted in publishing their paper “Generative adversarial imitation learning for robot swarms: Learning from human demonstrations and trained policies”. During the three years of his bachelor’s, he worked as a developer in the energy engineering industry at AVAT, cooperating with companies like Schwarzwaldmilch and Hyundai Heavy Industries.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar48",
        "title": "Adaptive Behavior as Probabilistic Inference",
        "date": "2025-12-03",
        "time": "11:30 - 12:15",
        "speaker": "Jake Graving",
        "topic": "Adaptive Behavior as Probabilistic Inference",
        "image": "images/jake_graving.png",
        "abstract": "Animals must choose where to move and what to do under uncertainty, limited time, and energetic constraints. I’ll outline a compact framework that casts adaptive behavior as probabilistic inference: agents maintain beliefs over options and choose actions to maximize utility and reduce uncertainty, revealing a principled trade-off between exploration and exploitation. Using simplified models of spatiotemporal decision-making, I’ll show how this lens unifies normative and mechanistic views, recovers familiar circuit motifs as special cases, and explains patterns like conflict, compromise, and commitment. I’ll close with examples of fitting interpretable models to behavioral data and using counterfactual policies to identify environmental cues that shape decisions.",
        "bio": "Jake Graving is a Research Scientist at the Max Planck Institute of Animal Behavior. His work sits at the intersection of machine learning, computer vision, and Bayesian inference, developing scalable and interpretable methods for measuring and modeling behavior in the lab and field. His current work focuses on probabilistic models of decision-making and inverse methods to recover decision policies from behavioral data in individuals and groups.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar49",
        "title": "On the Cost of Evolving Task Specialization in Multi-Robot Systems",
        "date": "2025-12-09",
        "time": "11:30 - 12:15",
        "speaker": "Paolo Leopardi",
        "topic": " On the Cost of Evolving Task Specialization in Multi-Robot Systems",
        "image": "images/paolo_leopardi.jpg",
        "abstract": "Task specialization can lead to simpler behaviors and higher efficiency in multi-robot systems. Previous studies have demonstrated the emergence of task-specific robot controllers through evolutionary optimization. However, most of these studies have prioritized feasibility over cost. Using a foraging task inspired by leafcutter ants, we evolved artificial neural networks with generalist behaviors for the entire task and task-specialist behaviors for subtasks, within a limited evaluation budget. This constraint naturally arises when high-fidelity simulators are required to ensure a reliable transfer from simulation to real-world robotic systems. We demonstrate that generalist behaviors can be successfully optimized, whereas the optimized task-specialist controllers fail to cooperate efficiently. Consequently, task specialization may not yield higher efficiency under restricted optimization budgets.",
        "bio": "Paolo Leopardi is a Ph.D. candidate in the Cyber-Physical Systems Group at the University of Konstanz and a member of the Center for the Advanced Study of Collective Behaviour. His research focuses on evolutionary swarm robotics, investigating how task partitioning and task allocation emerge in robot swarms. He holds a Master’s degree in Computer and Robotics Engineering from the University of Perugia, Italy. Since 2025, he has been a board member of the editorial team of the prestigious and worldwide recognized Sci-Phy seminar series.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar50",
        "title": "Modelling active sensing collectives.",
        "date": "2025-12-17",
        "time": "11:30 - 12:15",
        "speaker": "Aditya Moger",
        "topic": "Modelling active sensing collectives.",
        "image": "images/aditya_moger.jpg",
        "abstract": "Active-sensing animals like bats probe their environment by emitting energy and analyzing returning signals. A single bat's call generates a cascade of echoes from objects, which the auditory system must segregate into one coherent spatial scene. This problem is exaggerated in social groups as one must also discriminate own echoes from the calls and echoes of con-specifics. Then, how do bats navigate dense swarms without colliding when facing jamming? To answer this, we develop biologically parameterized models of bats. First, we use a static model to characterize the auditory scene of individual bats. We find that echo-acoustic information in collectives is limited and is constrained by the group’s orientation and individual's spatial position. We then construct a dynamic model to investigate collective coordination despite compromised sensing and heuristic behaviors that bats could be utilizing. We demonstrate a reduction in collision rates when individuals integrate information over larger times and respond to calls of others rather than relying on self-echoes. We also explore echo-acoustic flow, where bats may utilize the consistency in sound arrival and angle to enhance echo detection and mitigate jamming costs in dense groups.",
        "bio": "I am a masters student at the Indian Institute for Science Education and Research, Pune (IISER Pune). My thesis work, supervised by Thejasvi Beleyur, focuses on developing agent based models to understand bat collective behavior. I love animals (and their behavior ofc!) and I am having fun using my computational modeling skills to understand how bats do cool stuff! ",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar51",
        "title": "How Swarms Differ: Challenges in Collective Behaviour Comparison.",
        "date": "2026-01-21",
        "time": "11:30 - 12:15",
        "speaker": "André Jesus",
        "topic": "How Swarms Differ: Challenges in Collective Behaviour Comparison.",
        "image": "images/andré_jesus.jpg",
        "abstract": "In this talk, I will explore the role of behavioural similarity assessment in swarm robotics and its relevance to imitation learning, and review existing approaches proposed by the community. However, these approaches typically address narrow behavioural contexts, making it difficult to establish a general methodology or unifying framework for swarm roboticists. Consequently, I will present a range of behavioural similarity assessment methods, including feature-based and generative adversarial approaches, and discuss how they can support more systematic imitation learning in swarms.",
        "bio": "I am a Ph.D. researcher in the Robot Swarm Learning group at the University of Konstanz where I’m affiliated with the Centre for the Advanced Study of Collective Behaviour. My research focuses on imitation learning for robot swarms, drawing inspiration from natural swarm intelligence. Previously, I worked as a Robotics Researcher at the Technology Innovation Institute in Abu Dhabi. I hold a Master’s degree in Artificial Intelligence from Vrije Universiteit Amsterdam.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar52",
        "title": "Fission–Fusion Processes for Regulation of Group Size and Number in Multi-Agent Systems.",
        "date": "2026-02-04",
        "time": "11:30 - 12:15",
        "speaker": "Tianfu Zhang",
        "topic": "Fission–Fusion Processes for Regulation of Group Size and Number in Multi-Agent Systems.",
        "image": "images/tianfu_zhang.jpg",
        "abstract": "Multi-agent systems often require the formation of subgroups of varying sizes to solve their assigned task. In dynamic environments, it becomes an online problem as groups must continuously adjust their size and composition to maintain overall efficiency and stability. We propose a decentralized group regulation framework inspired by natural fission-fusion dynamics. Our approach combines a gossip-based group size estimation algorithm with a probabilistic behavioral control model. We enable anonymous agents to asynchronously estimate their group sizes using only local information and to autonomously execute group merging or splitting behaviors. Simulation results show stable and adaptive group size regulation under different communication modes and dynamic conditions. Our unified mechanism regulates both the size and number of groups and has potential to serve as a theoretical and algorithmic foundation for this fundamental but underexplored problem.",
        "bio": "Tianfu Zhang is a Ph.D. candidate in the Cyber-Physical Systems Group at the University of Konstanz.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar53",
        "title": "Decision-making Models across Scales.",
        "date": "2026-01-28",
        "time": "11:30 - 12:15",
        "speaker": "Dan Gorbonos",
        "topic": "Decision-making Models across Scales.",
        "image": "images/dan_gorbonos.jpg",
        "abstract": "Many approaches to autonomous robot navigation struggle to make rapid decisions when confronted with symmetric goals, even though such speed is essential for robust, real-time autonomy. We propose a modeling framework in which decision making manifests as a phase transition, and we characterize its generic structure. We demonstrate how this mechanism can account for both individual and collective decision making in animal behavior, and we discuss its potential application to autonomous navigation.",
        "bio": "TBA.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar54",
        "title": "Stable Robot Motions on Manifolds: Learning Lyapunov-Constrained Neural Manifold ODEs.",
        "date": "2026-03-11",
        "time": "11:30 - 12:15",
        "speaker": "David Boetius",
        "topic": "Stable Robot Motions on Manifolds: Learning Lyapunov-Constrained Neural Manifold ODEs.",
        "image": "images/david_boetius.jpg",
        "abstract": "Neural ordinary differential equations provide a continuous-time, expressive framework for learning robot dynamics from data, making them well suited for motion generation. Recently, neural ODEs have been extended to Riemannian manifolds, the geometric structures that many important robotic quantities such as rotations and stiffness lie on. In this talk, I will presents a framework that combines neural ODEs on Riemannian manifolds with learned Lyapunov functions to provide stability guarantees. Stability is essential for ensuring robust task completion in motion generation.",
        "bio": " David Boetius is a PhD student at University of Konstant working on formal methods for neural networks under the supervision of Stefan Leue and Tobias Sutter. Recently, he has developed an an interest in cyber-physical systems.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar55",
        "title": "Doing your own thing, together: The special role of specialized roles in group coordination.",
        "date": "2026-02-11",
        "time": "11:30 - 12:15",
        "speaker": "Robert Goldstone",
        "topic": "Doing your own thing, together: The special role of specialized roles in group coordination.",
        "image": "images/robert_goldstone.jpg",
        "abstract": "Humans routinely form groups to achieve goals that no individual could accomplish on their own.  Across several collective behavior paradigms that we have studied, effective group coordination arises not from all members acting in unison, but from a division of labor that emerges during group interactions. Successful division of labor is facilitated by players assuming specialized roles, with players over time becoming more consistent in their own behavior, and more differentiated from the other players.  The computational models that fit human group behavior the best and also perform the best have mechanisms to A) communicate intentions, plans, and proposals across group members, B) adapt to feedback provided by the environment, C) repulse a member’s behavior from others, D) create plans at multiple temporal scales, from moment-to-moment shifts in task coverage to the lifelong development of expertise, and E) infer other members’ knowledge and intentions from their behaviors.",
        "bio": "Robert Goldstone is a Distinguished Professor in the Psychological and Brain Sciences department and Cognitive Science program at Indiana University. His research interests include concept learning and representation, perceptual learning, educational applications of cognitive science, decision making, collective behavior, and computational modeling of human cognition.  He won the 1996 Chase Memorial Prize, the 2000 APA Distinguished Scientific Award for Early Career Contribution to Psychology, a 2004 Troland research award from the National Academy of Sciences, and the 2024 Warren Medal for Outstanding Achievement in Experimental Psychology from the Society of Experimental Psychologists.  He was the executive editor of Cognitive Science from 2001-2005, Director of the Indiana University Cognitive Science Program from 2006-2011, and executive editor of Current Directions in Psychological Science from 2020-2025.  He has been elected as a fellow of the Society of Experimental Psychologists, the Cognitive Science Society, and the American Academy of Arts and Sciences.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar56",
        "title": "A winter of simulation: Above, on, and under water.",
        "date": "2026-02-18",
        "time": "11:30 - 12:15",
        "speaker": "Pranav Kedia",
        "topic": "A winter of simulation: Above, on, and under water.",
        "image": "images/pranav_kedia.jpg",
        "abstract": "I present my results from a “winter of simulation” in which fieldwork was largely impractical, prompting me to use virtual experiments to de-risk ideas that span above, on, and under water. I introduce SailSwarmSwIM, a scalable simulator for swarms of autonomous sailboats in which wind is treated as a first-class system state, and classical collective-motion models must be adapted to sailing constraints, such as no-go zones and tacking. The key result is that gusts and waves can drive repeatable, non-monotonic changes in swarm metrics (area, polarization), highlighting that environment fields can shape collective behavior as strongly as interaction rules. Underwater, I present BIND-USBL, a HoloOcean-based study of heterogeneous ASV–AUV teams in GPS-denied conditions, where a surface vehicle acts as a mobile base station and provides event-triggered USBL corrections to bound IMU drift under a limited acoustic servicing budget.",
        "bio": "Hello! I'm Pranav Kedia, a Ph.D. researcher at the cyber physical group supervised by Prof. Dr. Heiko Hamann at the University of Konstanz, where I'm affiliated with the Centre for the Advanced Study of Collective Behaviour. I am working on a swarm of autonomous sailboats optimized for long-duration endurance. This research has been a combination of learning about sailing and applying my skills and knowledge in Embedded systems and Robotics. Previously, I worked on Bee Waggle Robot in the EU H2020 project 'Hiveopolis' at the Biorobtics Lab led by Prof. Dr. Tim Landgraf at the Free University of Berlin. I completed my master's majoring in electronics and communication with a specialization in embedded systems at IIIT-B. Previously, I was fortunate to be part of the Surgical and Assistive Robotics Lab, led by Prof. Madhav Rao. I was also part of the ARMS lab, led by Dr. Arpita Sinha at IIT Bombay, India, in the summer of 2019. Prof. Sachit Rao had supervised me on guided coursework and non-course projects. I enjoy working on Bio-inspired Swarm Robotics and Swarm Intelligence methods.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar57",
        "title": "ROS-2-ARGoS Bridge: Scalable Simulations of Swarms of 1000 and More Robots.",
        "date": "2026-02-25",
        "time": "11:30 - 12:15",
        "speaker": "Paolo Leopardi",
        "topic": "ROS-2-ARGoS Bridge: Scalable Simulations of Swarms of 1000 and More Robots.",
        "image": "images/paolo_leopardi.jpg",
        "abstract": "The Robot Operating System (ROS) is a widely adopted collection of software libraries and tools for designing and implementing robot control software. Its rapid growth has been driven by an active community that maintains an extensive ecosystem of reusable components, increasingly positioning ROS as a unifying framework bridging academic research and industrial applications. ROS 2 importantly enables decentralized, peer-to-peer communication, making it well suited for scalable and reliable multi-robot systems. Simulations play a critical role in the design and implementation of robotic systems prior to their real-world deployment. For large-scale robotic systems, simulation scalability, that is, the efficient simulation of many robots, is essential. However, existing ROS-based simulators are unable to scale to large numbers of robots, while highly scalable simulators lack integration with the ROS ecosystem. We introduce the ROS-2-ARGoS Bridge, a framework for simulating large-scale robotic systems running software based on ROS 2. We showcase its scalability through experiments with up to 1280 simulated robots that locally interact and coordinate their actions. As industries increasingly seek to scale up their robotic infrastructures, our open-source framework offers a timely and practical solution for simulating and designing large-scale multi-robot and swarm systems.",
        "bio": "Paolo Leopardi is a Ph.D. candidate in the Cyber-Physical Systems Group at the University of Konstanz and a member of the Center for the Advanced Study of Collective Behaviour. His research focuses on evolutionary swarm robotics, investigating how task partitioning and task allocation emerge in robot swarms. He holds a Master’s degree in Computer and Robotics Engineering from the University of Perugia, Italy. Since 2025, he has been a board member of the editorial team of the prestigious and worldwide recognized Sci-Phy seminar series.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar58",
        "title": "Co-improvising with the non-human: embedding algorithms inspired by group intelligence into semi-autonomous instruments for musical improvisation.",
        "date": "2026-03-04",
        "time": "11:30 - 12:15",
        "speaker": "Federico Visi",
        "topic": "Co-improvising with the non-human: embedding algorithms inspired by group intelligence into semi-autonomous instruments for musical improvisation.",
        "image": "images/federico_visi.jpeg",
        "abstract": "In this seminar, I will present my current artistic research into how non-human group intelligence and self-organisation can inform the design of multi-agent systems for musical co-improvisation. Central to my work is the Sophtar, a string instrument I developed that features an embedded system capable of running recent machine learning models and signal processing algorithms, automated electromechanical actuators, and controlled electroacoustic feedback capabilities. The instrument acts as a boundary object, a place of encounter between newly developed co-improvising algorithmic agents and human performers. I will introduce the instrument, its current algorithms and models, and those planned for experimentation during my residency at CASCB. Finally, I will outline the ideas behind a hardware co-improvising agent currently in the early stages of development.",
        "bio": "Federico Visi is a researcher and musician based in Berlin, Germany. His work explores the interplay between human and non-human agencies in music, embodiment in networked music performance, and interactive machine learning. He has recently designed a networkable feedback string instrument with embedded machine learning called the Sophtar. He currently works as a researcher at Luleå University of Technology and he is a member of the TCP/Indeterminate Place networked hyperorgan quartet. He obtained his PhD at the Interdisciplinary Centre for Computer Music Research (ICCMR), University of Plymouth, and collaborates with research labs at several international institutions including University of Iceland, Goldsmiths University of London, and Universität der Künste Berlin.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar59",
        "title": "Stochastic Bandits on the Rise: Lever-aging Rising Bandits for AutoML.",
        "date": "2026-03-18",
        "time": "11:30 - 12:15",
        "speaker": "Till Aust",
        "topic": "Stochastic Bandits on the Rise: Lever-aging Rising Bandits for AutoML.",
        "image": "images/Aust.png",
        "abstract": "TBA.",
        "bio": "Till Aust studied Robotics and Autonomous Systems at the University of Lübeck, where he earned both his Bachelor's and Master's degrees. He then joined the Cyber-Physical Systems Group led by Prof. Heiko Hamann as a PhD student, focusing on the analysis of physiological signals in bio-hybrid systems. His research contributes to the EU-funded projects WatchPlant and ChronoPilot, where he explores methods to interpret physiological data for controlling bio-hybrid systems and enabling feedback mechanisms.",
        "location": "Z8 Kitchen"
    },
    {
        "id": "seminar60",
        "title": "Reactive collision avoidance for a mobile robot using omnidirectional optical flow.",
        "date": "2026-03-18",
        "time": "11:30 - 12:15",
        "speaker": "Vassil Radoynovski",
        "topic": "Reactive collision avoidance for a mobile robot using omnidirectional optical flow.",
        "image": "images/vassil_radoynovski.png",
        "abstract": "TBA.",
        "bio": "TBA.",
        "location": "Z8 Kitchen"
    }
]
